[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:9:46
 import { hasRole } from "main/utils/currentUser";
 
 export default function AdminCommonsCard({ commonItem, currentUser }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [isHovered, setIsHovered] = useState(false);
   const navigate = useNavigate();
killedBy: AdminCommonsCard tests modal starts closed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminCommonsCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:10:46
 
 export default function AdminCommonsCard({ commonItem, currentUser }) {
   const [showModal, setShowModal] = useState(false);
-  const [isHovered, setIsHovered] = useState(false);
+  const [isHovered, setIsHovered] = useState(true);
   const navigate = useNavigate();
   const commons = commonItem.commons;
killedBy: AdminCommonsCard tests card hover state starts as false
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- boxShadow: 0 2px 4px rgba(0,0,0,0.1);

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:15:5
   const commons = commonItem.commons;
 
   const deleteMutation = useBackendMutation(
-    (commonItem) => ({
-      url: "/api/commons",
-      method: "DELETE",
-      params: { id: commonItem.commons.id },
-    }),
+    () => undefined,
     { onSuccess: onDeleteSuccess },
     ["/api/commons/allplus"],
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:17:15
   const deleteMutation = useBackendMutation(
     (commonItem) => ({
       url: "/api/commons",
-      method: "DELETE",
+      method: "",
       params: { id: commonItem.commons.id },
     }),
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Commons/AdminCommonsCard.jsx:20:5
       method: "DELETE",
       params: { id: commonItem.commons.id },
     }),
-    { onSuccess: onDeleteSuccess },
+    {},
     ["/api/commons/allplus"],
   );
killedBy: AdminCommonsCard tests delete mutation invalidates commons cache
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received: 

  1st useBackendMutation call:

  [
-   Any<Function>,

[Killed] ArrayDeclaration
main/components/Commons/AdminCommonsCard.jsx:21:5
       params: { id: commonItem.commons.id },
     }),
     { onSuccess: onDeleteSuccess },
-    ["/api/commons/allplus"],
+    [],
   );
 
killedBy: AdminCommonsCard tests delete mutation invalidates commons cache
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received: 

  1st useBackendMutation call:

  [
-   Any<Function>,

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:24:28
     ["/api/commons/allplus"],
   );
 
-  const handleEdit = () => {
-    navigate(`/admin/editcommons/${commons.id}`);
-  };
+  const handleEdit = () => {};
 
   const handleDelete = () => {
killedBy: AdminCommonsCard tests edit button navigates to edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:25:14
   );
 
   const handleEdit = () => {
-    navigate(`/admin/editcommons/${commons.id}`);
+    navigate(``);
   };
 
killedBy: AdminCommonsCard tests edit button navigates to edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Received: 

  1st spy call:

  [
-   "/admin/editcommons/1",

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:28:30
     navigate(`/admin/editcommons/${commons.id}`);
   };
 
-  const handleDelete = () => {
-    setShowModal(true);
-  };
+  const handleDelete = () => {};
 
   const confirmDelete = async () => {
killedBy: AdminCommonsCard tests delete button opens modal
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Modal-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:29:18
   };
 
   const handleDelete = () => {
-    setShowModal(true);
+    setShowModal(false);
   };
 
killedBy: AdminCommonsCard tests delete button opens modal
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Modal-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:32:37
     setShowModal(true);
   };
 
-  const confirmDelete = async () => {
-    deleteMutation.mutate(commonItem);
-    setShowModal(false);
-  };
+  const confirmDelete = async () => {};
 
   const handleLeaderboard = () => {
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Commons with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:34:18
 
   const confirmDelete = async () => {
     deleteMutation.mutate(commonItem);
-    setShowModal(false);
+    setShowModal(true);
   };
 
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminCommonsCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:37:35
     setShowModal(false);
   };
 
-  const handleLeaderboard = () => {
-    navigate(`/leaderboard/${commons.id}`);
-  };
+  const handleLeaderboard = () => {};
 
   const formatDate = (dateString) => {
killedBy: AdminCommonsCard tests leaderboard button navigates to leaderboard page
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Number of calls: 0

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:41:38
     navigate(`/leaderboard/${commons.id}`);
   };
 
-  const formatDate = (dateString) => {
-    return String(dateString).slice(0, 10);
-  };
+  const formatDate = (dateString) => {};
 
   const deleteModal = (
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2022-11-22
Received:

[Killed] MethodExpression
main/components/Commons/AdminCommonsCard.jsx:42:12
   };
 
   const formatDate = (dateString) => {
-    return String(dateString).slice(0, 10);
+    return String(dateString);
   };
 
killedBy: AdminCommonsCard tests formatDate formats date string correctly
statusReason: Unable to find an element with the text: 2022-11-22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3 card"
      data-testid="AdminCommonsCard-1"

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:47:20
 
   const deleteModal = (
     <Modal
-      data-testid={`AdminCommonsCard-Modal-${commons.id}`}
+      data-testid={``}
       show={showModal}
       onHide={() => setShowModal(false)}
killedBy: AdminCommonsCard tests delete button opens modal
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Modal-1"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:49:15
     <Modal
       data-testid={`AdminCommonsCard-Modal-${commons.id}`}
       show={showModal}
-      onHide={() => setShowModal(false)}
+      onHide={() => undefined}
     >
       <Modal.Header closeButton>
killedBy: AdminCommonsCard tests modal onHide closes modal when escape key is pressed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminCommonsCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:49:34
     <Modal
       data-testid={`AdminCommonsCard-Modal-${commons.id}`}
       show={showModal}
-      onHide={() => setShowModal(false)}
+      onHide={() => setShowModal(true)}
     >
       <Modal.Header closeButton>
killedBy: AdminCommonsCard tests modal onHide closes modal when escape key is pressed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminCommonsCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:59:20
         <Button
           variant="secondary"
           data-testid={`AdminCommonsCard-Modal-Cancel-${commons.id}`}
-          onClick={() => setShowModal(false)}
+          onClick={() => undefined}
         >
           Keep this Commons
killedBy: AdminCommonsCard tests modal cancel button closes modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminCommonsCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:59:39
         <Button
           variant="secondary"
           data-testid={`AdminCommonsCard-Modal-Cancel-${commons.id}`}
-          onClick={() => setShowModal(false)}
+          onClick={() => setShowModal(true)}
         >
           Keep this Commons
killedBy: AdminCommonsCard tests modal cancel button closes modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminCommonsCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:74:44
     </Modal>
   );
 
-  if (!hasRole(currentUser, "ROLE_ADMIN")) {
-    return null;
-  }
+  if (!hasRole(currentUser, "ROLE_ADMIN")) {}
 
   // Stryker disable all - styles that don't need to be mut tested
killedBy: AdminCommonsCard tests returns null for non-admin user
statusReason: expected <div …(3)>…(2)</div> to be null

[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:74:7
     </Modal>
   );
 
-  if (!hasRole(currentUser, "ROLE_ADMIN")) {
+  if (true) {
     return null;
   }
killedBy: AdminCommonsCard tests renders without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:104:23
         className="mb-3"
         data-testid={`AdminCommonsCard-${commons.id}`}
         style={cardStyle}
-        onMouseEnter={() => setIsHovered(true)}
+        onMouseEnter={() => undefined}
         onMouseLeave={() => setIsHovered(false)}
       >
killedBy: AdminCommonsCard tests card has hover state
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- boxShadow: 0 4px 8px rgba(0,0,0,0.17);

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:104:42
         className="mb-3"
         data-testid={`AdminCommonsCard-${commons.id}`}
         style={cardStyle}
-        onMouseEnter={() => setIsHovered(true)}
+        onMouseEnter={() => setIsHovered(false)}
         onMouseLeave={() => setIsHovered(false)}
       >
killedBy: AdminCommonsCard tests card has hover state
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- boxShadow: 0 4px 8px rgba(0,0,0,0.17);

[Killed] BooleanLiteral
main/components/Commons/AdminCommonsCard.jsx:105:42
         data-testid={`AdminCommonsCard-${commons.id}`}
         style={cardStyle}
         onMouseEnter={() => setIsHovered(true)}
-        onMouseLeave={() => setIsHovered(false)}
+        onMouseLeave={() => setIsHovered(true)}
       >
         <Card.Header style={headerStyle}>
killedBy: AdminCommonsCard tests card has hover state
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- boxShadow: 0 2px 4px rgba(0,0,0,0.1);

[Killed] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:105:23
         data-testid={`AdminCommonsCard-${commons.id}`}
         style={cardStyle}
         onMouseEnter={() => setIsHovered(true)}
-        onMouseLeave={() => setIsHovered(false)}
+        onMouseLeave={() => undefined}
       >
         <Card.Header style={headerStyle}>
killedBy: AdminCommonsCard tests card has hover state
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- boxShadow: 0 2px 4px rgba(0,0,0,0.1);

[Killed] LogicalOperator
main/components/Commons/AdminCommonsCard.jsx:166:21
               <div>
                 <strong>Total Cows:</strong>
               </div>
-              <div>{commonItem.totalCows || 0}</div>
+              <div>{commonItem.totalCows && 0}</div>
             </Col>
             <Col xs={12} sm={6} md={3} className="mb-3">
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:
  0

[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:166:21
               <div>
                 <strong>Total Cows:</strong>
               </div>
-              <div>{commonItem.totalCows || 0}</div>
+              <div>{true}</div>
             </Col>
             <Col xs={12} sm={6} md={3} className="mb-3">
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] LogicalOperator
main/components/Commons/AdminCommonsCard.jsx:184:21
               <div>
                 <strong>Eff Cap:</strong>
               </div>
-              <div>{commonItem.effectiveCapacity || 0}</div>
+              <div>{commonItem.effectiveCapacity && 0}</div>
             </Col>
           </Row>
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100
Received:
  0

[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:184:21
               <div>
                 <strong>Eff Cap:</strong>
               </div>
-              <div>{commonItem.effectiveCapacity || 0}</div>
+              <div>{false}</div>
             </Col>
           </Row>
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100
Received:

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:216:21
             <Button
               variant="success"
               size="sm"
-              href={`/api/commonstats/download?commonsId=${commons.id}`}
+              href={``}
               data-testid={`AdminCommonsCard-StatsCSV-${commons.id}`}
             >
killedBy: AdminCommonsCard tests stats CSV button has correct href
statusReason: expect(element).toHaveAttribute("href", "/api/commonstats/download?commonsId=1") // element.getAttribute("href") === "/api/commonstats/download?commonsId=1"

Expected the element to have attribute:
  href="/api/commonstats/download?commonsId=1"
Received:
  href=""

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:224:21
             <Button
               variant="info"
               size="sm"
-              href={`/admin/announcements/${commons.id}`}
+              href={``}
               data-testid={`AdminCommonsCard-Announcements-${commons.id}`}
             >
killedBy: AdminCommonsCard tests announcements button has correct href
statusReason: expect(element).toHaveAttribute("href", "/admin/announcements/1") // element.getAttribute("href") === "/admin/announcements/1"

Expected the element to have attribute:
  href="/admin/announcements/1"
Received:
  href=""
