[Killed] ConditionalExpression
main/components/Commons/CommonsCard.jsx:17:12
           <Col sx={4} data-testid={`${testIdPrefix}-name-${commons.id}`}>
             {commons.name}
           </Col>
-          {buttonText != null && (
+          {true && (
             <Col sm={4}>
               <Button
killedBy: CommonsCard tests renders no button when button text is null
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="buttonchange btn btn-primary btn-sm"
  data-testid="commonsCard-button-null-5"
  type="button"
/> instead

[Killed] EqualityOperator
main/components/Commons/CommonsCard.jsx:17:12
           <Col sx={4} data-testid={`${testIdPrefix}-name-${commons.id}`}>
             {commons.name}
           </Col>
-          {buttonText != null && (
+          {buttonText == null && (
             <Col sm={4}>
               <Button
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: Unable to find an element by: [data-testid="commonsCard-button-Join-5"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="woodenboardtable card-body"
    >

[Killed] BlockStatement
main/components/Commons/CommonsCard.jsx:23:32
                 data-testid={`${testIdPrefix}-button-${buttonText}-${commons.id}`}
                 size="sm"
                 className="buttonchange"
-                onClick={() => {
-                  if (
-                    buttonText === "Join" &&
-                    isFutureDate(commons.startingDate)
-                  ) {
-                    // Stryker disable all: unable to read alert text in tests
-                    alert(
-                      "This commons has not started yet and cannot be joined.\nThe starting date is " +
-                        parseInt(commons.startingDate.substring(5, 7)) +
-                        "/" +
-                        parseInt(commons.startingDate.substring(8, 10)) +
-                        "/" +
-                        parseInt(commons.startingDate),
-                    );
-                    // Stryker restore all
-                  } else {
-                    buttonLink(commons.id);
-                  }
-                }}
+                onClick={() => {}}
               >
                 {buttonText}
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: expected "spy" to be called with arguments: [ '/play/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.jsx:25:21
                 className="buttonchange"
                 onClick={() => {
                   if (
-                    buttonText === "Join" &&
-                    isFutureDate(commons.startingDate)
+                    false
                   ) {
                     // Stryker disable all: unable to read alert text in tests
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] LogicalOperator
main/components/Commons/CommonsCard.jsx:25:21
                 className="buttonchange"
                 onClick={() => {
                   if (
-                    buttonText === "Join" &&
-                    isFutureDate(commons.startingDate)
+                    buttonText === "Join" || isFutureDate(commons.startingDate)
                   ) {
                     // Stryker disable all: unable to read alert text in tests
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/Commons/CommonsCard.jsx:27:21
                   if (
                     buttonText === "Join" &&
                     isFutureDate(commons.startingDate)
-                  ) {
-                    // Stryker disable all: unable to read alert text in tests
-                    alert(
-                      "This commons has not started yet and cannot be joined.\nThe starting date is " +
-                        parseInt(commons.startingDate.substring(5, 7)) +
-                        "/" +
-                        parseInt(commons.startingDate.substring(8, 10)) +
-                        "/" +
-                        parseInt(commons.startingDate),
-                    );
-                    // Stryker restore all
-                  } else {
+                  ) {} else {
                     buttonLink(commons.id);
                   }
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called 1 times, but got 0 times
