[Killed] LogicalOperator
main/components/Commons/commonsCardUtils.js:2:7
 function extractDateParts(value) {
-  if (value instanceof Date && !Number.isNaN(value.getTime())) {
+  if (value instanceof Date || !Number.isNaN(value.getTime())) {
     return {
       year: value.getFullYear(),
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/Commons/commonsCardUtils.js:2:64
 function extractDateParts(value) {
-  if (value instanceof Date && !Number.isNaN(value.getTime())) {
-    return {
-      year: value.getFullYear(),
-      month: value.getMonth() + 1,
-      day: value.getDate(),
-    };
-  }
+  if (value instanceof Date && !Number.isNaN(value.getTime())) {}
 
   if (typeof value === "string") {
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] ArithmeticOperator
main/components/Commons/commonsCardUtils.js:5:14
   if (value instanceof Date && !Number.isNaN(value.getTime())) {
     return {
       year: value.getFullYear(),
-      month: value.getMonth() + 1,
+      month: value.getMonth() - 1,
       day: value.getDate(),
     };
killedBy: CommonsCard tests can join commons with past date - past month
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
main/components/Commons/commonsCardUtils.js:10:7
     };
   }
 
-  if (typeof value === "string") {
+  if (typeof value !== "string") {
     const [datePortion] = value.split("T");
     const match = datePortion.match(/^(\d{4})-(\d{2})-(\d{2})$/);
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] BlockStatement
main/components/Commons/commonsCardUtils.js:10:34
     };
   }
 
-  if (typeof value === "string") {
-    const [datePortion] = value.split("T");
-    const match = datePortion.match(/^(\d{4})-(\d{2})-(\d{2})$/);
-    if (!match) {
-      return null;
-    }
-
-    const [, yearStr, monthStr, dayStr] = match;
-    return {
-      year: Number.parseInt(yearStr, 10),
-      month: Number.parseInt(monthStr, 10),
-      day: Number.parseInt(dayStr, 10),
-    };
-  }
+  if (typeof value === "string") {}
 
   return null;
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] BooleanLiteral
main/components/Commons/commonsCardUtils.js:13:9
   if (typeof value === "string") {
     const [datePortion] = value.split("T");
     const match = datePortion.match(/^(\d{4})-(\d{2})-(\d{2})$/);
-    if (!match) {
+    if (match) {
       return null;
     }
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] BlockStatement
main/components/Commons/commonsCardUtils.js:13:17
   if (typeof value === "string") {
     const [datePortion] = value.split("T");
     const match = datePortion.match(/^(\d{4})-(\d{2})-(\d{2})$/);
-    if (!match) {
-      return null;
-    }
+    if (!match) {}
 
     const [, yearStr, monthStr, dayStr] = match;
killedBy: isFutureDate helper handles invalid or missing starting dates gracefully
statusReason: match is not iterable

[Killed] ObjectLiteral
main/components/Commons/commonsCardUtils.js:18:12
     }
 
     const [, yearStr, monthStr, dayStr] = match;
-    return {
-      year: Number.parseInt(yearStr, 10),
-      month: Number.parseInt(monthStr, 10),
-      day: Number.parseInt(dayStr, 10),
-    };
+    return {};
   }
 
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] BlockStatement
main/components/Commons/commonsCardUtils.js:28:65
   return null;
 }
 
-function isFutureDate(startingDate, referenceDate = new Date()) {
-  const startParts = extractDateParts(startingDate);
-  const referenceParts =
-    extractDateParts(referenceDate) ?? extractDateParts(new Date());
-
-  if (!startParts || !referenceParts) {
-    return false;
-  }
-
-  const startDate = new Date(
-    startParts.year,
-    startParts.month - 1,
-    startParts.day,
-  );
-  const referenceDateOnly = new Date(
-    referenceParts.year,
-    referenceParts.month - 1,
-    referenceParts.day,
-  );
-
-  return startDate.getTime() > referenceDateOnly.getTime();
-}
+function isFutureDate(startingDate, referenceDate = new Date()) {}
 
 export { extractDateParts, isFutureDate };
killedBy: CommonsCard tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] LogicalOperator
main/components/Commons/commonsCardUtils.js:31:5
 function isFutureDate(startingDate, referenceDate = new Date()) {
   const startParts = extractDateParts(startingDate);
   const referenceParts =
-    extractDateParts(referenceDate) ?? extractDateParts(new Date());
+    extractDateParts(referenceDate) && extractDateParts(new Date());
 
   if (!startParts || !referenceParts) {
killedBy: isFutureDate helper detects future dates within the same month
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsCardUtils.js:33:7
   const referenceParts =
     extractDateParts(referenceDate) ?? extractDateParts(new Date());
 
-  if (!startParts || !referenceParts) {
+  if (false) {
     return false;
   }
killedBy: isFutureDate helper handles invalid or missing starting dates gracefully
statusReason: Cannot read properties of null (reading 'year')

[Killed] LogicalOperator
main/components/Commons/commonsCardUtils.js:33:7
   const referenceParts =
     extractDateParts(referenceDate) ?? extractDateParts(new Date());
 
-  if (!startParts || !referenceParts) {
+  if (!startParts && !referenceParts) {
     return false;
   }
killedBy: isFutureDate helper handles invalid or missing starting dates gracefully
statusReason: Cannot read properties of null (reading 'year')

[Killed] BooleanLiteral
main/components/Commons/commonsCardUtils.js:34:12
     extractDateParts(referenceDate) ?? extractDateParts(new Date());
 
   if (!startParts || !referenceParts) {
-    return false;
+    return true;
   }
 
killedBy: isFutureDate helper handles invalid or missing starting dates gracefully
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
main/components/Commons/commonsCardUtils.js:39:5
 
   const startDate = new Date(
     startParts.year,
-    startParts.month - 1,
+    startParts.month + 1,
     startParts.day,
   );
killedBy: CommonsCard tests can join commons with past date - past month
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArithmeticOperator
main/components/Commons/commonsCardUtils.js:44:5
   );
   const referenceDateOnly = new Date(
     referenceParts.year,
-    referenceParts.month - 1,
+    referenceParts.month + 1,
     referenceParts.day,
   );
killedBy: CommonsCard tests cannot join commons with future start date - future month
statusReason: expected "spy" to be called +0 times, but got 1 times

[Killed] EqualityOperator
main/components/Commons/commonsCardUtils.js:48:10
     referenceParts.day,
   );
 
-  return startDate.getTime() > referenceDateOnly.getTime();
+  return startDate.getTime() <= referenceDateOnly.getTime();
 }
 
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
main/components/Commons/commonsCardUtils.js:48:10
     referenceParts.day,
   );
 
-  return startDate.getTime() > referenceDateOnly.getTime();
+  return true;
 }
 
killedBy: CommonsCard tests renders without crashing when button text is set
statusReason: expected "spy" to be called 1 times, but got 0 times
