[Killed] StringLiteral
src/main/components/OurTable.jsx:23:12
 export default function OurTable({
   columns,
   data,
-  testid = "testid",
+  testid = "",
   ...rest
 }) {
killedBy: OurTable tests default testid is testId
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:27:20
   ...rest
 }) {
   const [pageIndex, setPageIndex] = React.useState(0);
-  const pageSize = rest.pageSize || 10;
+  const pageSize = false;
 
   const { getTableProps, getTableBodyProps, headerGroups, rows, prepareRow } =
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] LogicalOperator
src/main/components/OurTable.jsx:27:20
   ...rest
 }) {
   const [pageIndex, setPageIndex] = React.useState(0);
-  const pageSize = rest.pageSize || 10;
+  const pageSize = rest.pageSize && 10;
 
   const { getTableProps, getTableBodyProps, headerGroups, rows, prepareRow } =
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ObjectLiteral
src/main/components/OurTable.jsx:31:7
 
   const { getTableProps, getTableBodyProps, headerGroups, rows, prepareRow } =
     useTable(
-      {
-        columns,
-        data,
-        ...(rest.initialState && {
-          initialState: rest.initialState,
-        }),
-      },
+      {},
       useSortBy,
     );
killedBy: CoursesTable tests Has the expected column headers and content for ordinary user
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:34:13
       {
         columns,
         data,
-        ...(rest.initialState && {
-          initialState: rest.initialState,
-        }),
+        ...(true),
       },
       useSortBy,
killedBy: PagedJobsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:34:13
       {
         columns,
         data,
-        ...(rest.initialState && {
-          initialState: rest.initialState,
-        }),
+        ...(false),
       },
       useSortBy,
killedBy: PagedJobsTable tests renders correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] BlockStatement
src/main/components/OurTable.jsx:50:54
               headerGroup.getHeaderGroupProps();
             return (
               <tr key={hgKey} {...hgProps}>
-                {headerGroup.headers.map((column) => {
-                  const headerProps = column.getHeaderProps(
-                    column.getSortByToggleProps(),
-                  );
-                  const { key: colKey, ...restHeaderProps } = headerProps;
-                  return (
-                    <th
-                      key={colKey}
-                      {...restHeaderProps}
-                      data-testid={`${testid}-header-${column.id}`}
-                    >
-                      {column.render("Header")}
-                      <span
-                        data-testid={`${testid}-header-${column.id}-sort-carets`}
-                      >
-                        {column.isSorted
-                          ? column.isSortedDesc
-                            ? " 🔽"
-                            : " 🔼"
-                          : ""}
-                      </span>
-                    </th>
-                  );
-                })}
+                {headerGroup.headers.map((column) => {})}
               </tr>
             );
killedBy: OurTable tests default testid is testId
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:59:36
                     <th
                       key={colKey}
                       {...restHeaderProps}
-                      data-testid={`${testid}-header-${column.id}`}
+                      data-testid={``}
                     >
                       {column.render("Header")}
killedBy: OurTable tests default testid is testId
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:61:38
                       {...restHeaderProps}
                       data-testid={`${testid}-header-${column.id}`}
                     >
-                      {column.render("Header")}
+                      {column.render("")}
                       <span
                         data-testid={`${testid}-header-${column.id}-sort-carets`}
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Renderer Error ☝️

[Killed] StringLiteral
src/main/components/OurTable.jsx:63:38
                     >
                       {column.render("Header")}
                       <span
-                        data-testid={`${testid}-header-${column.id}-sort-carets`}
+                        data-testid={``}
                       >
                         {column.isSorted
killedBy: PagedJobsTable tests renders correct content
statusReason: Unable to find an element by: [data-testid="PagedJobsTable-header-id-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] StringLiteral
src/main/components/OurTable.jsx:68:31
                         {column.isSorted
                           ? column.isSortedDesc
                             ? " 🔽"
-                            : " 🔼"
+                            : ""
                           : ""}
                       </span>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: 🔼. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] MethodExpression
src/main/components/OurTable.jsx:79:12
           })}
         </thead>
         <tbody {...getTableBodyProps()}>
-          {rows
-            .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
+          {rows
             .map((row) => {
               prepareRow(row);
killedBy: OurTable tests renders a table with 11 rows and clicks on the next page button and previous page button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="testid-cell-row-10-col-col1"
  role="cell"
>
  Hello 11
</td> instead

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:80:20
         </thead>
         <tbody {...getTableBodyProps()}>
           {rows
-            .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
+            .slice(pageIndex / pageSize, (pageIndex + 1) * pageSize)
             .map((row) => {
               prepareRow(row);
killedBy: OurTable tests renders a table with 51 rows and tests moving forward and back one page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="testid-cell-row-10-col-col1"
  role="cell"
>
  Hello 11
</td> instead

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:80:43
         </thead>
         <tbody {...getTableBodyProps()}>
           {rows
-            .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
+            .slice(pageIndex * pageSize, (pageIndex - 1) * pageSize)
             .map((row) => {
               prepareRow(row);
killedBy: PagedJobsTable tests renders correct content
statusReason: Unable to find an element by: [data-testid="PagedJobsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] BlockStatement
src/main/components/OurTable.jsx:81:27
         <tbody {...getTableBodyProps()}>
           {rows
             .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
-            .map((row) => {
-              prepareRow(row);
-              const rowProps = row.getRowProps();
-              const { key: rowKey, ...restRowProps } = rowProps;
-              return (
-                <tr key={rowKey} {...restRowProps}>
-                  {row.cells.map((cell, _index) => {
-                    const cellProps = cell.getCellProps();
-                    const { key: cellKey, ...restCellProps } = cellProps;
-                    return (
-                      <td
-                        key={cellKey}
-                        {...restCellProps}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
-                </tr>
-              );
-            })}
+            .map((row) => {})}
         </tbody>
       </Table>
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
src/main/components/OurTable.jsx:87:52
               const { key: rowKey, ...restRowProps } = rowProps;
               return (
                 <tr key={rowKey} {...restRowProps}>
-                  {row.cells.map((cell, _index) => {
-                    const cellProps = cell.getCellProps();
-                    const { key: cellKey, ...restCellProps } = cellProps;
-                    return (
-                      <td
-                        key={cellKey}
-                        {...restCellProps}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
+                  {row.cells.map((cell, _index) => {})}
                 </tr>
               );
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:94:38
                       <td
                         key={cellKey}
                         {...restCellProps}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
+                        data-testid={``}
                       >
                         {cell.render("Cell")}
killedBy: PagedJobsTable tests renders correct content
statusReason: Unable to find an element by: [data-testid="PagedJobsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Page: 
      1

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:105:8
             })}
         </tbody>
       </Table>
-      {rows.length > pageSize && (
+      {true && (
         <div style={paginationStyle}>
           <Pagination {...getTableProps()}>
killedBy: OurTable tests pagination isn't visible when there is no data
statusReason: expected <span class="page-link" …(1)>…(2)</span> to be null // Object.is equality

[Killed] EqualityOperator
src/main/components/OurTable.jsx:105:8
             })}
         </tbody>
       </Table>
-      {rows.length > pageSize && (
+      {rows.length <= pageSize && (
         <div style={paginationStyle}>
           <Pagination {...getTableProps()}>
killedBy: OurTable tests pagination isn't visible when there is no data
statusReason: expected <span class="page-link" …(1)>…(2)</span> to be null // Object.is equality

[Killed] ArrowFunction
src/main/components/OurTable.jsx:109:24
         <div style={paginationStyle}>
           <Pagination {...getTableProps()}>
             <Pagination.Prev
-              onClick={() => setPageIndex(pageIndex - 1)}
+              onClick={() => undefined}
               data-testid={`${testid}-prev-page-button`}
               disabled={pageIndex === 0}
killedBy: OurTable tests renders a table with 11 rows and clicks on the next page button and previous page button
statusReason: Unable to find an element with the text: Hello 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:109:43
         <div style={paginationStyle}>
           <Pagination {...getTableProps()}>
             <Pagination.Prev
-              onClick={() => setPageIndex(pageIndex - 1)}
+              onClick={() => setPageIndex(pageIndex + 1)}
               data-testid={`${testid}-prev-page-button`}
               disabled={pageIndex === 0}
killedBy: OurTable tests renders a table with 11 rows and clicks on the next page button and previous page button
statusReason: Unable to find an element with the text: Hello 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:111:25
             <Pagination.Prev
               onClick={() => setPageIndex(pageIndex - 1)}
               data-testid={`${testid}-prev-page-button`}
-              disabled={pageIndex === 0}
+              disabled={false}
             />
             {pageIndex > 3 && (
killedBy: OurTable tests renders a table with 11 rows and clicks on the next page button and previous page button
statusReason: expect(element).toHaveClass("disabled")

Expected the element to have class:
  disabled
Received:
  page-item

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:111:25
             <Pagination.Prev
               onClick={() => setPageIndex(pageIndex - 1)}
               data-testid={`${testid}-prev-page-button`}
-              disabled={pageIndex === 0}
+              disabled={true}
             />
             {pageIndex > 3 && (
killedBy: OurTable tests renders a table with 11 rows and clicks on the next page button and previous page button
statusReason: expect(element).not.toHaveClass("disabled")

Expected the element not to have class:
  disabled
Received:
  page-item disabled

[Killed] LogicalOperator
src/main/components/OurTable.jsx:113:14
               data-testid={`${testid}-prev-page-button`}
               disabled={pageIndex === 0}
             />
-            {pageIndex > 3 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(0)}
-                data-testid={`${testid}-first-page-button`}
-              >
-                {1}
-              </Pagination.Item>
-            )}
+            {pageIndex > 3 || <Pagination.Item onClick={() => setPageIndex(0)} data-testid={`${testid}-first-page-button`}>
+                {1}
+              </Pagination.Item>}
             {pageIndex > 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-first-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] EqualityOperator
src/main/components/OurTable.jsx:113:14
               data-testid={`${testid}-prev-page-button`}
               disabled={pageIndex === 0}
             />
-            {pageIndex > 3 && (
+            {pageIndex <= 3 && (
               <Pagination.Item
                 onClick={() => setPageIndex(0)}
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-first-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArrowFunction
src/main/components/OurTable.jsx:115:26
             />
             {pageIndex > 3 && (
               <Pagination.Item
-                onClick={() => setPageIndex(0)}
+                onClick={() => undefined}
                 data-testid={`${testid}-first-page-button`}
               >
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="page-link"
  data-testid="testid-first-page-button"
  href="#"
  role="button"
  tabindex="0"

[Killed] StringLiteral
src/main/components/OurTable.jsx:116:30
             {pageIndex > 3 && (
               <Pagination.Item
                 onClick={() => setPageIndex(0)}
-                data-testid={`${testid}-first-page-button`}
+                data-testid={``}
               >
                 {1}
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-first-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] EqualityOperator
src/main/components/OurTable.jsx:121:14
                 {1}
               </Pagination.Item>
             )}
-            {pageIndex > 4 && (
+            {pageIndex >= 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
killedBy: OurTable tests renders a table with 51 rows and moving forward and back two pages
statusReason: expected <a class="page-link" …(4)>…(2)</a> to be null // Object.is equality

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:121:14
                 {1}
               </Pagination.Item>
             )}
-            {pageIndex > 4 && (
-              <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
-            )}
+            {true}
             {pageIndex === 4 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:122:49
               </Pagination.Item>
             )}
             {pageIndex > 4 && (
-              <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
+              <Pagination.Ellipsis data-testid={``} />
             )}
             {pageIndex === 4 && (
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] EqualityOperator
src/main/components/OurTable.jsx:124:14
             {pageIndex > 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
-            {pageIndex === 4 && (
+            {pageIndex !== 4 && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 3)}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:124:14
             {pageIndex > 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
-            {pageIndex === 4 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 3)}
-                data-testid={`${testid}-back-three-page-button`}
-              >
-                {pageIndex - 2}
-              </Pagination.Item>
-            )}
+            {false}
             {pageIndex > 1 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 41 rows and moving forward and back three pages
statusReason: Unable to find an element by: [data-testid="testid-back-three-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:126:45
             )}
             {pageIndex === 4 && (
               <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 3)}
+                onClick={() => setPageIndex(pageIndex + 3)}
                 data-testid={`${testid}-back-three-page-button`}
               >
killedBy: OurTable tests renders a table with 41 rows and moving forward and back three pages
statusReason: expect(element).toContainHTML()
Expected:
  2
Received:
  <span
  class="page-link"
  data-testid="testid-current-page-button"
>

[Killed] ArrowFunction
src/main/components/OurTable.jsx:126:26
             )}
             {pageIndex === 4 && (
               <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 3)}
+                onClick={() => undefined}
                 data-testid={`${testid}-back-three-page-button`}
               >
killedBy: OurTable tests renders a table with 41 rows and moving forward and back three pages
statusReason: expect(element).toContainHTML()
Expected:
  2
Received:
  <span
  class="page-link"
  data-testid="testid-current-page-button"
>

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:129:18
                 onClick={() => setPageIndex(pageIndex - 3)}
                 data-testid={`${testid}-back-three-page-button`}
               >
-                {pageIndex - 2}
+                {pageIndex + 2}
               </Pagination.Item>
             )}
killedBy: OurTable tests renders a table with 41 rows and moving forward and back three pages
statusReason: expect(element).toContainHTML()
Expected:
  2
Received:
  <a
  class="page-link"
  data-testid="testid-back-three-page-button"
  href="#"

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:132:14
                 {pageIndex - 2}
               </Pagination.Item>
             )}
-            {pageIndex > 1 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 2)}
-                data-testid={`${testid}-back-two-page-button`}
-              >
-                {pageIndex - 1}
-              </Pagination.Item>
-            )}
+            {true}
             {pageIndex > 0 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Unable to find an element by: [data-testid="testid-back-two-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:132:14
                 {pageIndex - 2}
               </Pagination.Item>
             )}
-            {pageIndex > 1 && (
+            {true && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 2)}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] ArrowFunction
src/main/components/OurTable.jsx:134:26
             )}
             {pageIndex > 1 && (
               <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 2)}
+                onClick={() => undefined}
                 data-testid={`${testid}-back-two-page-button`}
               >
killedBy: OurTable tests renders a table with 51 rows and moving forward and back two pages
statusReason: Unable to find an element by: [data-testid="testid-last-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:134:45
             )}
             {pageIndex > 1 && (
               <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 2)}
+                onClick={() => setPageIndex(pageIndex + 2)}
                 data-testid={`${testid}-back-two-page-button`}
               >
killedBy: OurTable tests renders a table with 51 rows and moving forward and back two pages
statusReason: Unable to find an element by: [data-testid="testid-last-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:137:18
                 onClick={() => setPageIndex(pageIndex - 2)}
                 data-testid={`${testid}-back-two-page-button`}
               >
-                {pageIndex - 1}
+                {pageIndex + 1}
               </Pagination.Item>
             )}
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: expect(element).toContainHTML()
Expected:
  4
Received:
  <a
  class="page-link"
  data-testid="testid-back-two-page-button"
  href="#"

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:140:14
                 {pageIndex - 1}
               </Pagination.Item>
             )}
-            {pageIndex > 0 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 1)}
-                data-testid={`${testid}-back-one-page-button`}
-              >
-                {pageIndex}
-              </Pagination.Item>
-            )}
+            {false}
             <Pagination.Item
               data-testid={`${testid}-current-page-button`}
killedBy: OurTable tests renders a table with 51 rows and tests moving forward and back one page
statusReason: Unable to find an element by: [data-testid="testid-back-one-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] EqualityOperator
src/main/components/OurTable.jsx:140:14
                 {pageIndex - 1}
               </Pagination.Item>
             )}
-            {pageIndex > 0 && (
+            {pageIndex >= 0 && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 1)}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] ArrowFunction
src/main/components/OurTable.jsx:142:26
             )}
             {pageIndex > 0 && (
               <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 1)}
+                onClick={() => undefined}
                 data-testid={`${testid}-back-one-page-button`}
               >
killedBy: OurTable tests renders a table with 51 rows and tests moving forward and back one page
statusReason: expect(element).toContainHTML()
Expected:
  1
Received:
  <span
  class="page-link"
  data-testid="testid-current-page-button"
>

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:142:45
             )}
             {pageIndex > 0 && (
               <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 1)}
+                onClick={() => setPageIndex(pageIndex + 1)}
                 data-testid={`${testid}-back-one-page-button`}
               >
killedBy: OurTable tests renders a table with 51 rows and tests moving forward and back one page
statusReason: expect(element).toContainHTML()
Expected:
  1
Received:
  <span
  class="page-link"
  data-testid="testid-current-page-button"
>
