[Killed] LogicalOperator
src/main/pages/AdminListCommonPageV2.jsx:44:12
           </Col>
         </Row>
         <Container fluid className="pt-3">
-          {commons &&
-            commons.map((common) => (
-              <AdminCommonsCard
-                key={common.commons.id}
-                commonItem={common}
-                currentUser={currentUser}
-              />
-            ))}
+          {commons || commons.map(common => <AdminCommonsCard key={common.commons.id} commonItem={common} currentUser={currentUser} />)}
         </Container>
       </div>
killedBy: AdminListCommonPageV2 tests renders three commons without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/pages/AdminListCommonPageV2.jsx:44:12
           </Col>
         </Row>
         <Container fluid className="pt-3">
-          {commons &&
-            commons.map((common) => (
-              <AdminCommonsCard
-                key={common.commons.id}
-                commonItem={common}
-                currentUser={currentUser}
-              />
-            ))}
+          {false}
         </Container>
       </div>
killedBy: AdminListCommonPageV2 tests renders three commons without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminListCommonPageV2.jsx:45:25
         </Row>
         <Container fluid className="pt-3">
           {commons &&
-            commons.map((common) => (
-              <AdminCommonsCard
-                key={common.commons.id}
-                commonItem={common}
-                currentUser={currentUser}
-              />
-            ))}
+            commons.map(() => undefined)}
         </Container>
       </div>
killedBy: AdminListCommonPageV2 tests renders three commons without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
