[Killed] ObjectLiteral
main/components/Chat/ChatDisplay.jsx:25:5
         size: initialMessagePageSize,
       },
     },
-    { content: [], totalElements: 0 },
+    {},
     { refetchInterval: refreshRate },
   );
killedBy: ChatDisplay tests configures chat and user commons queries with expected arguments
statusReason: expected 1st "useBackend" call to have been called with [ …(4) ]

[Killed] ArrayDeclaration
main/components/Chat/ChatDisplay.jsx:25:16
         size: initialMessagePageSize,
       },
     },
-    { content: [], totalElements: 0 },
+    { content: ["Stryker was here"], totalElements: 0 },
     { refetchInterval: refreshRate },
   );
killedBy: ChatDisplay tests displays no messages correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="card-title h5"
  data-testid="ChatMessageDisplay-undefined-User"
  style="margin: 0px;"
>
  Anonymous

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:33:12
     [`/api/usercommons/commons/all`],
     {
       method: "GET",
-      url: "/api/usercommons/commons/all",
+      url: "",
       params: {
         commonsId: commonsId,
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expected '' to be '/api/usercommons/commons/all' // Object.is equality

[Killed] OptionalChaining
main/components/Chat/ChatDisplay.jsx:42:40
     { refetchInterval: refreshRate },
   );
 
-  const messageContent = Array.isArray(messagesPage?.content)
+  const messageContent = Array.isArray(messagesPage.content)
     ? messagesPage.content
     : undefined;
killedBy: ChatDisplay tests renders when chat messages response is undefined
statusReason: Cannot read properties of undefined (reading 'content')

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:46:32
     ? messagesPage.content
     : undefined;
   const sortedMessages = Array.isArray(messageContent)
-    ? [...messageContent].sort((a, b) => b.id - a.id)
+    ? [...messageContent].sort(() => undefined)
     : null;
 
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expected 'ChatMessageDisplay-2' to be 'ChatMessageDisplay-1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
main/components/Chat/ChatDisplay.jsx:46:42
     ? messagesPage.content
     : undefined;
   const sortedMessages = Array.isArray(messageContent)
-    ? [...messageContent].sort((a, b) => b.id - a.id)
+    ? [...messageContent].sort((a, b) => b.id + a.id)
     : null;
 
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expected 'ChatMessageDisplay-2' to be 'ChatMessageDisplay-1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/Chat/ChatDisplay.jsx:50:45
     : null;
 
   const userIdToUsername = Array.isArray(userCommonsList)
-    ? userCommonsList.reduce((acc, user) => {
-        acc[user.userId] = user.username || "";
-        return acc;
-      }, {})
+    ? userCommonsList.reduce((acc, user) => {}, {})
     : {};
 
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Unable to find an element by: [data-testid="ChatDisplay"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:51:28
 
   const userIdToUsername = Array.isArray(userCommonsList)
     ? userCommonsList.reduce((acc, user) => {
-        acc[user.userId] = user.username || "";
+        acc[user.userId] = true;
         return acc;
       }, {})
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  George Washington
Received:

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:51:28
 
   const userIdToUsername = Array.isArray(userCommonsList)
     ? userCommonsList.reduce((acc, user) => {
-        acc[user.userId] = user.username || "";
+        acc[user.userId] = false;
         return acc;
       }, {})
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  George Washington
Received:
  Anonymous

[Killed] EqualityOperator
main/components/Chat/ChatDisplay.jsx:57:5
     : {};
 
   const totalElements =
-    typeof messagesPage?.totalElements === "number"
+    typeof messagesPage?.totalElements !== "number"
       ? messagesPage.totalElements
       : undefined;
killedBy: ChatDisplay tests shows history link when totalElements indicates more messages than returned
statusReason: Unable to find an element by: [data-testid="ChatDisplay-HistoryLink"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:57:5
     : {};
 
   const totalElements =
-    typeof messagesPage?.totalElements === "number"
+    true
       ? messagesPage.totalElements
       : undefined;
killedBy: ChatDisplay tests renders when chat messages response is undefined
statusReason: Cannot read properties of undefined (reading 'totalElements')

[Killed] EqualityOperator
main/components/Chat/ChatDisplay.jsx:64:5
     ? sortedMessages.length
     : 0;
   const showHistoryLink =
-    (totalElements ?? messageCount) > initialMessagePageSize;
+    (totalElements ?? messageCount) <= initialMessagePageSize;
   const historyLink = `/chat/${commonsId}`;
 
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ChatDisplay-HistoryLink"
  style="text-align: center; padding: 0.75rem 0px 0.25rem; font-size: 0.9rem; color: rgb(13, 110, 253);"
>
  <a
    data-discover="true"

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:64:6
     ? sortedMessages.length
     : 0;
   const showHistoryLink =
-    (totalElements ?? messageCount) > initialMessagePageSize;
+    (totalElements && messageCount) > initialMessagePageSize;
   const historyLink = `/chat/${commonsId}`;
 
killedBy: ChatDisplay tests displays at most 10 messages and shows history link when more exist
statusReason: Unable to find an element by: [data-testid="ChatDisplay-HistoryLink"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:72:26
       <div
         style={{
           display: "flex",
-          flexDirection: "column-reverse",
+          flexDirection: "",
           overflowY: "scroll",
           maxHeight: "300px",
killedBy: ChatDisplay tests renders without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- flexDirection: column-reverse;

[Killed] MethodExpression
main/components/Chat/ChatDisplay.jsx:78:10
         }}
         data-testid="ChatDisplay"
       >
-        {(Array.isArray(sortedMessages) ? sortedMessages : [])
-          .slice(0, initialMessagePageSize)
+        {Array.isArray(sortedMessages) ? sortedMessages : []
           .map((message) => (
             <ChatMessageDisplay
killedBy: ChatDisplay tests displays at most 10 messages and shows history link when more exist
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="card bg-secondary text-white"
  data-testid="ChatMessageDisplay-2"
>
  <div
    class="card-body"

[Killed] ArrowFunction
main/components/Chat/ChatDisplay.jsx:80:16
       >
         {(Array.isArray(sortedMessages) ? sortedMessages : [])
           .slice(0, initialMessagePageSize)
-          .map((message) => (
-            <ChatMessageDisplay
-              key={message.id}
-              message={{
-                ...message,
-                username: userIdToUsername[message.userId],
-              }}
-            />
-          ))}
+          .map(() => undefined)}
       </div>
       {showHistoryLink && (
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: Cannot read properties of undefined (reading 'getAttribute')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
main/components/Chat/ChatDisplay.jsx:90:8
             />
           ))}
       </div>
-      {showHistoryLink && (
-        <div
-          style={{
-            textAlign: "center",
-            padding: "0.75rem 0 0.25rem",
-            fontSize: "0.9rem",
-            color: "#0d6efd",
-          }}
-          data-testid="ChatDisplay-HistoryLink"
-        >
-          <Link to={historyLink} style={{ textDecoration: "none" }}>
-            View full chat history
-          </Link>
-        </div>
-      )}
+      {showHistoryLink || <div style={{
+  textAlign: "center",
+  padding: "0.75rem 0 0.25rem",
+  fontSize: "0.9rem",
+  color: "#0d6efd"
+}} data-testid="ChatDisplay-HistoryLink">
+          <Link to={historyLink} style={{
+    textDecoration: "none"
+  }}>
+            View full chat history
+          </Link>
+        </div>}
     </>
   );
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ChatDisplay-HistoryLink"
  style="text-align: center; padding: 0.75rem 0px 0.25rem; font-size: 0.9rem; color: rgb(13, 110, 253);"
>
  <a
    data-discover="true"

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:90:8
             />
           ))}
       </div>
-      {showHistoryLink && (
-        <div
-          style={{
-            textAlign: "center",
-            padding: "0.75rem 0 0.25rem",
-            fontSize: "0.9rem",
-            color: "#0d6efd",
-          }}
-          data-testid="ChatDisplay-HistoryLink"
-        >
-          <Link to={historyLink} style={{ textDecoration: "none" }}>
-            View full chat history
-          </Link>
-        </div>
-      )}
+      {true}
     </>
   );
killedBy: ChatDisplay tests displays at most 10 messages and shows history link when more exist
statusReason: Unable to find an element by: [data-testid="ChatDisplay-HistoryLink"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ChatDisplay"
      style="display: flex; flex-direction: column-reverse; overflow-y: scroll; max-height: 300px;"

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:94:22
         <div
           style={{
             textAlign: "center",
-            padding: "0.75rem 0 0.25rem",
+            padding: "",
             fontSize: "0.9rem",
             color: "#0d6efd",
killedBy: ChatDisplay tests history link applies the expected styling
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- padding: 0.75rem 0px 0.25rem;

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:95:23
           style={{
             textAlign: "center",
             padding: "0.75rem 0 0.25rem",
-            fontSize: "0.9rem",
+            fontSize: "",
             color: "#0d6efd",
           }}
killedBy: ChatDisplay tests history link applies the expected styling
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-size: 0.9rem;

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:96:20
             textAlign: "center",
             padding: "0.75rem 0 0.25rem",
             fontSize: "0.9rem",
-            color: "#0d6efd",
+            color: "",
           }}
           data-testid="ChatDisplay-HistoryLink"
killedBy: ChatDisplay tests history link applies the expected styling
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- color: rgb(13, 110, 253);
