[Killed] StringLiteral
main/components/Commons/CommonsFeaturesForm.jsx:7:17
 export default function CommonsFeaturesForm({
   features = {},
   onSubmit,
-  buttonLabel = "Save",
+  buttonLabel = "",
 }) {
   const [localFeatures, setLocalFeatures] = useState({});
killedBy: CommonsFeaturesForm tests renders correctly with single feature
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Save
Received:

[Killed] BlockStatement
main/components/Commons/CommonsFeaturesForm.jsx:11:19
 }) {
   const [localFeatures, setLocalFeatures] = useState({});
 
-  useEffect(() => {
-    setLocalFeatures({ ...features });
-  }, [features]);
+  useEffect(() => {}, [features]);
 
   const handleCheckboxChange = (featureName) => {
killedBy: CommonsFeaturesForm tests renders correctly with single feature
statusReason: Unable to find an element by: [data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Commons/CommonsFeaturesForm.jsx:12:22
   const [localFeatures, setLocalFeatures] = useState({});
 
   useEffect(() => {
-    setLocalFeatures({ ...features });
+    setLocalFeatures({});
   }, [features]);
 
killedBy: CommonsFeaturesForm tests renders correctly with single feature
statusReason: Unable to find an element by: [data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrayDeclaration
main/components/Commons/CommonsFeaturesForm.jsx:13:6
 
   useEffect(() => {
     setLocalFeatures({ ...features });
-  }, [features]);
+  }, []);
 
   const handleCheckboxChange = (featureName) => {
killedBy: CommonsFeaturesForm tests updates local state when features prop changes
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"
  id="FARMERS_CAN_SEE_LEADERBOARD"
  type="checkbox"

[Killed] BlockStatement
main/components/Commons/CommonsFeaturesForm.jsx:15:49
     setLocalFeatures({ ...features });
   }, [features]);
 
-  const handleCheckboxChange = (featureName) => {
-    setLocalFeatures((prev) => ({
-      ...prev,
-      [featureName]: !prev[featureName],
-    }));
-  };
+  const handleCheckboxChange = (featureName) => {};
 
   const handleSubmit = (e) => {
killedBy: CommonsFeaturesForm tests handles checkbox changes correctly
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"
  id="FARMERS_CAN_SEE_LEADERBOARD"
  type="checkbox"

[Killed] ArrowFunction
main/components/Commons/CommonsFeaturesForm.jsx:16:22
   }, [features]);
 
   const handleCheckboxChange = (featureName) => {
-    setLocalFeatures((prev) => ({
-      ...prev,
-      [featureName]: !prev[featureName],
-    }));
+    setLocalFeatures(() => undefined);
   };
 
killedBy: CommonsFeaturesForm tests calls onSubmit with updated features when form is submitted
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
main/components/Commons/CommonsFeaturesForm.jsx:18:22
   const handleCheckboxChange = (featureName) => {
     setLocalFeatures((prev) => ({
       ...prev,
-      [featureName]: !prev[featureName],
+      [featureName]: prev[featureName],
     }));
   };
killedBy: CommonsFeaturesForm tests handles checkbox changes correctly
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"
  id="FARMERS_CAN_SEE_LEADERBOARD"
  type="checkbox"

[Killed] BlockStatement
main/components/Commons/CommonsFeaturesForm.jsx:22:31
     }));
   };
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-    if (onSubmit) {
-      onSubmit(localFeatures);
-    }
-  };
+  const handleSubmit = (e) => {};
 
   const formatFeatureName = (featureName) => {
killedBy: CommonsFeaturesForm tests calls onSubmit with updated features when form is submitted
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/Commons/CommonsFeaturesForm.jsx:24:19
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (onSubmit) {
-      onSubmit(localFeatures);
-    }
+    if (onSubmit) {}
   };
 
killedBy: CommonsFeaturesForm tests calls onSubmit with updated features when form is submitted
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
main/components/Commons/CommonsFeaturesForm.jsx:24:9
 
   const handleSubmit = (e) => {
     e.preventDefault();
-    if (onSubmit) {
+    if (false) {
       onSubmit(localFeatures);
     }
killedBy: CommonsFeaturesForm tests calls onSubmit with updated features when form is submitted
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/Commons/CommonsFeaturesForm.jsx:29:46
     }
   };
 
-  const formatFeatureName = (featureName) => {
-    return featureName
-      .split("_")
-      .map((word) => word.charAt(0) + word.slice(1).toLowerCase())
-      .join(" ");
-  };
+  const formatFeatureName = (featureName) => {};
 
   return (
killedBy: CommonsFeaturesForm tests renders correctly with single feature
statusReason: Unable to find a label with the text of: Farmers Can See Leaderboard

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArithmeticOperator
main/components/Commons/CommonsFeaturesForm.jsx:32:22
   const formatFeatureName = (featureName) => {
     return featureName
       .split("_")
-      .map((word) => word.charAt(0) + word.slice(1).toLowerCase())
+      .map((word) => word.charAt(0) - word.slice(1).toLowerCase())
       .join(" ");
   };
killedBy: CommonsFeaturesForm tests renders correctly with single feature
statusReason: Unable to find a label with the text of: Farmers Can See Leaderboard

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/Commons/CommonsFeaturesForm.jsx:32:12
   const formatFeatureName = (featureName) => {
     return featureName
       .split("_")
-      .map((word) => word.charAt(0) + word.slice(1).toLowerCase())
+      .map(() => undefined)
       .join(" ");
   };
killedBy: CommonsFeaturesForm tests renders correctly with single feature
statusReason: Unable to find a label with the text of: Farmers Can See Leaderboard

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/Commons/CommonsFeaturesForm.jsx:39:41
   return (
     <Form onSubmit={handleSubmit}>
       <Row>
-        {Object.keys(localFeatures).map((featureName) => (
-          <Col key={featureName} md={6} className="mb-3">
-            <Form.Group>
-              <Form.Check
-                type="checkbox"
-                id={featureName}
-                label={formatFeatureName(featureName)}
-                checked={localFeatures[featureName] || false}
-                onChange={() => handleCheckboxChange(featureName)}
-                data-testid={`CommonsFeaturesForm-${featureName}`}
-              />
-            </Form.Group>
-          </Col>
-        ))}
+        {Object.keys(localFeatures).map(() => undefined)}
       </Row>
       <Row>
killedBy: CommonsFeaturesForm tests renders correctly with single feature
statusReason: Unable to find an element by: [data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsFeaturesForm.jsx:46:26
                 type="checkbox"
                 id={featureName}
                 label={formatFeatureName(featureName)}
-                checked={localFeatures[featureName] || false}
+                checked={false}
                 onChange={() => handleCheckboxChange(featureName)}
                 data-testid={`CommonsFeaturesForm-${featureName}`}
killedBy: CommonsFeaturesForm tests handles checkbox changes correctly
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"
  id="FARMERS_CAN_SEE_LEADERBOARD"
  type="checkbox"

[Killed] ConditionalExpression
main/components/Commons/CommonsFeaturesForm.jsx:46:26
                 type="checkbox"
                 id={featureName}
                 label={formatFeatureName(featureName)}
-                checked={localFeatures[featureName] || false}
+                checked={true}
                 onChange={() => handleCheckboxChange(featureName)}
                 data-testid={`CommonsFeaturesForm-${featureName}`}
killedBy: CommonsFeaturesForm tests handles checkbox changes correctly
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"
  id="FARMERS_CAN_SEE_LEADERBOARD"

[Killed] ArrowFunction
main/components/Commons/CommonsFeaturesForm.jsx:47:27
                 id={featureName}
                 label={formatFeatureName(featureName)}
                 checked={localFeatures[featureName] || false}
-                onChange={() => handleCheckboxChange(featureName)}
+                onChange={() => undefined}
                 data-testid={`CommonsFeaturesForm-${featureName}`}
               />
killedBy: CommonsFeaturesForm tests handles checkbox changes correctly
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CommonsFeaturesForm-FARMERS_CAN_SEE_LEADERBOARD"
  id="FARMERS_CAN_SEE_LEADERBOARD"
  type="checkbox"
