[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:14:18
 export default function CoursesTable({
   courses,
   currentUser,
-  testIdPrefix = "CoursesTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: CoursesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:18:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/admin/editcourses/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   const deleteMutation = useBackendMutation(
killedBy: CoursesTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/admin/editcourses/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:19:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/admin/editcourses/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: CoursesTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/admin/editcourses/1' ]

Received: 

  1st spy call:

  [
-   "/admin/editcourses/1",

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.jsx:24:5
 
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
-    { onSuccess: onDeleteSuccess },
+    {},
     ["/api/course/all"],
   );
killedBy: CoursesTable tests Configures delete mutation with expected args
statusReason: expected "spy" to be called with arguments: [ …(3) ]

Received: 

  1st spy call:

  [
    [Function cellToAxiosParamsDelete],

[Killed] ArrayDeclaration
main/components/Courses/CoursesTable.jsx:25:5
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    ["/api/course/all"],
+    [],
   );
 
killedBy: CoursesTable tests Configures delete mutation with expected args
statusReason: expected "spy" to be called with arguments: [ …(3) ]

Received: 

  1st spy call:

  [
    [Function cellToAxiosParamsDelete],

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:25:6
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    ["/api/course/all"],
+    [""],
   );
 
killedBy: CoursesTable tests Configures delete mutation with expected args
statusReason: expected "spy" to be called with arguments: [ …(3) ]

Received: 

  1st spy call:

  [
    [Function cellToAxiosParamsDelete],

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:28:42
     ["/api/course/all"],
   );
 
-  const deleteCallback = async (cell) => {
-    deleteMutation.mutate(cell);
-  };
+  const deleteCallback = async (cell) => {};
 
   const columns = [
killedBy: CoursesTable tests Delete button calls delete callback
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.jsx:33:5
   };
 
   const columns = [
-    {
-      Header: "id",
-      accessor: "id",
-    },
+    {},
     {
       Header: "Code",
killedBy: CoursesTable tests Has the expected column headers and content for ordinary user
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:42:15
       accessor: "code",
     },
     {
-      Header: "Name",
+      Header: "",
       accessor: "name",
     },
killedBy: CoursesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:47:17
     },
     {
       Header: "Term",
-      accessor: "term",
+      accessor: "",
     },
   ];
killedBy: CoursesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-term"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
