[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:23:15
   const { data: userCommonsList } = useBackend(
     [`/api/usercommons/commons/all?commonsId=${commonsId}`],
     {
-      method: "GET",
+      method: "",
       url: "/api/usercommons/commons/all",
       params: {
killedBy: ChatHistoryPage configures user commons query with expected polling options
statusReason: expected "useBackend" to be called with arguments: [ …(4) ]

Received: 

  1st useBackend call:

@@ -1,11 +1,11 @@
  [

[Killed] ObjectLiteral
src/main/pages/ChatHistoryPage.jsx:25:15
     {
       method: "GET",
       url: "/api/usercommons/commons/all",
-      params: {
-        commonsId: commonsId,
-      },
+      params: {},
     },
     [],
killedBy: ChatHistoryPage configures user commons query with expected polling options
statusReason: expected "useBackend" to be called with arguments: [ …(4) ]

Received: 

  1st useBackend call:

@@ -2,13 +2,11 @@
    [

[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:30:48
       },
     },
     [],
-    { refetchInterval: REFRESH_RATE, enabled: !!commonsId },
+    { refetchInterval: REFRESH_RATE, enabled: !commonsId },
   );
 
killedBy: ChatHistoryPage configures user commons query with expected polling options
statusReason: expected "useBackend" to be called with arguments: [ …(4) ]

Received: 

  1st useBackend call:

@@ -9,9 +9,9 @@
      },

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:35:45
 
   const hasValidUserCommons = Array.isArray(userCommonsList);
   const userIdToUsername = hasValidUserCommons
-    ? userCommonsList.reduce((acc, user) => {
-        acc[user.userId] = user.username || "";
-        return acc;
-      }, {})
+    ? userCommonsList.reduce((acc, user) => {}, {})
     : {};
 
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:36:28
   const hasValidUserCommons = Array.isArray(userCommonsList);
   const userIdToUsername = hasValidUserCommons
     ? userCommonsList.reduce((acc, user) => {
-        acc[user.userId] = user.username || "";
+        acc[user.userId] = user.username && "";
         return acc;
       }, {})
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  George Washington
Received:
  Anonymous

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:41:54
       }, {})
     : {};
 
-  const fetchChatPage = async ({ pageParam = 0 }) => {
-    const response = await axios.get("/api/chat/get", {
-      params: {
-        commonsId: commonsId,
-        page: pageParam,
-        size: PAGE_SIZE,
-      },
-    });
-    return response.data;
-  };
+  const fetchChatPage = async ({ pageParam = 0 }) => {};
 
   const {
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/ChatHistoryPage.jsx:42:55
     : {};
 
   const fetchChatPage = async ({ pageParam = 0 }) => {
-    const response = await axios.get("/api/chat/get", {
-      params: {
-        commonsId: commonsId,
-        page: pageParam,
-        size: PAGE_SIZE,
-      },
-    });
+    const response = await axios.get("/api/chat/get", {});
     return response.data;
   };
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:59:25
     hasNextPage,
     isFetching,
     isFetchingNextPage,
-  } = useInfiniteQuery(["chatHistory", commonsId], fetchChatPage, {
+  } = useInfiniteQuery(["", commonsId], fetchChatPage, {
     getNextPageParam: (lastPage, pages) =>
       lastPage?.last === false ? pages.length : undefined,
killedBy: ChatHistoryPage configures chat history query with commons id and pagination logic
statusReason: expected [ '', 1 ] to deeply equal [ 'chatHistory', 1 ]

[Killed] ArrowFunction
src/main/pages/ChatHistoryPage.jsx:60:23
     isFetching,
     isFetchingNextPage,
   } = useInfiniteQuery(["chatHistory", commonsId], fetchChatPage, {
-    getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
+    getNextPageParam: () => undefined,
     refetchInterval: REFRESH_RATE,
     enabled: !!commonsId,
killedBy: ChatHistoryPage configures chat history query with commons id and pagination logic
statusReason: expected undefined to be 2 // Object.is equality

[Killed] EqualityOperator
src/main/pages/ChatHistoryPage.jsx:61:7
     isFetchingNextPage,
   } = useInfiniteQuery(["chatHistory", commonsId], fetchChatPage, {
     getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
+      lastPage?.last !== false ? pages.length : undefined,
     refetchInterval: REFRESH_RATE,
     enabled: !!commonsId,
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element with the text: [no more messages]. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:61:26
     isFetchingNextPage,
   } = useInfiniteQuery(["chatHistory", commonsId], fetchChatPage, {
     getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
+      lastPage?.last === true ? pages.length : undefined,
     refetchInterval: REFRESH_RATE,
     enabled: !!commonsId,
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element with the text: [no more messages]. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:63:14
     getNextPageParam: (lastPage, pages) =>
       lastPage?.last === false ? pages.length : undefined,
     refetchInterval: REFRESH_RATE,
-    enabled: !!commonsId,
+    enabled: !commonsId,
   });
 
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:66:19
     enabled: !!commonsId,
   });
 
-  useEffect(() => {
-    if (!hasNextPage) {
-      return;
-    }
-
-    const observer = new IntersectionObserver(
-      (entries) => {
-        if (entries[0].isIntersecting && hasNextPage && !isFetchingNextPage) {
-          fetchNextPage();
-        }
-      },
-      {
-        threshold: 1.0,
-      },
-    );
-
-    const currentRef = loadMoreRef.current;
-    observer.observe(currentRef);
-
-    return () => {
-      observer.unobserve(currentRef);
-    };
-  }, [fetchNextPage, hasNextPage, isFetchingNextPage]);
+  useEffect(() => {}, [fetchNextPage, hasNextPage, isFetchingNextPage]);
 
   const messages = Array.isArray(data?.pages)
killedBy: ChatHistoryPage does not fetch next page when observer entry is not intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:67:9
   });
 
   useEffect(() => {
-    if (!hasNextPage) {
+    if (true) {
       return;
     }
killedBy: ChatHistoryPage does not fetch next page when observer entry is not intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:67:23
   });
 
   useEffect(() => {
-    if (!hasNextPage) {
-      return;
-    }
+    if (!hasNextPage) {}
 
     const observer = new IntersectionObserver(
killedBy: ChatHistoryPage does not register an observer when there are no additional pages
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      [Function anonymous],

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:72:20
     }
 
     const observer = new IntersectionObserver(
-      (entries) => {
-        if (entries[0].isIntersecting && hasNextPage && !isFetchingNextPage) {
-          fetchNextPage();
-        }
-      },
+      (entries) => {},
       {
         threshold: 1.0,
killedBy: ChatHistoryPage wires up intersection observer to load additional pages
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:73:57
 
     const observer = new IntersectionObserver(
       (entries) => {
-        if (entries[0].isIntersecting && hasNextPage && !isFetchingNextPage) {
+        if (entries[0].isIntersecting && hasNextPage && isFetchingNextPage) {
           fetchNextPage();
         }
killedBy: ChatHistoryPage does not fetch next page while a fetch is already in progress
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:73:13
 
     const observer = new IntersectionObserver(
       (entries) => {
-        if (entries[0].isIntersecting && hasNextPage && !isFetchingNextPage) {
+        if (entries[0].isIntersecting && hasNextPage || !isFetchingNextPage) {
           fetchNextPage();
         }
killedBy: ChatHistoryPage does not fetch next page when observer entry is not intersecting
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:85:18
     const currentRef = loadMoreRef.current;
     observer.observe(currentRef);
 
-    return () => {
-      observer.unobserve(currentRef);
-    };
+    return () => {};
   }, [fetchNextPage, hasNextPage, isFetchingNextPage]);
 
killedBy: ChatHistoryPage wires up intersection observer to load additional pages
statusReason: expected "spy" to be called at least once

[Killed] OptionalChaining
src/main/pages/ChatHistoryPage.jsx:90:34
     };
   }, [fetchNextPage, hasNextPage, isFetchingNextPage]);
 
-  const messages = Array.isArray(data?.pages)
+  const messages = Array.isArray(data.pages)
     ? data.pages.flatMap((page) => {
         if (!page || !Array.isArray(page.content)) {
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Cannot read properties of undefined (reading 'pages')

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:91:36
   }, [fetchNextPage, hasNextPage, isFetchingNextPage]);
 
   const messages = Array.isArray(data?.pages)
-    ? data.pages.flatMap((page) => {
-        if (!page || !Array.isArray(page.content)) {
-          return [];
-        }
-        return page.content.map((message) => ({
-          ...message,
-          username: userIdToUsername[message.userId],
-        }));
-      })
+    ? data.pages.flatMap((page) => {})
     : [];
 
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:92:13
 
   const messages = Array.isArray(data?.pages)
     ? data.pages.flatMap((page) => {
-        if (!page || !Array.isArray(page.content)) {
+        if (false) {
           return [];
         }
killedBy: ChatHistoryPage renders no chat messages when a page omits the content array
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:92:13
 
   const messages = Array.isArray(data?.pages)
     ? data.pages.flatMap((page) => {
-        if (!page || !Array.isArray(page.content)) {
+        if (!page && !Array.isArray(page.content)) {
           return [];
         }
killedBy: ChatHistoryPage renders no chat messages when a page omits the content array
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrayDeclaration
src/main/pages/ChatHistoryPage.jsx:93:18
   const messages = Array.isArray(data?.pages)
     ? data.pages.flatMap((page) => {
         if (!page || !Array.isArray(page.content)) {
-          return [];
+          return ["Stryker was here"];
         }
         return page.content.map((message) => ({
killedBy: ChatHistoryPage renders no chat messages when a page omits the content array
statusReason: expected [ <div …(2)>…(1)</div>, …(3) ] to have a length of +0 but got 4

[Killed] ArrowFunction
src/main/pages/ChatHistoryPage.jsx:95:33
         if (!page || !Array.isArray(page.content)) {
           return [];
         }
-        return page.content.map((message) => ({
-          ...message,
-          username: userIdToUsername[message.userId],
-        }));
+        return page.content.map(() => undefined);
       })
     : [];
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:102:28
       })
     : [];
 
-  const isInitialLoading = status === "loading";
+  const isInitialLoading = false;
   const showError = status === "error";
 
killedBy: ChatHistoryPage shows loading indicator while initial messages fetch
statusReason: Unable to find an element with the text: /Loading messages.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:102:28
       })
     : [];
 
-  const isInitialLoading = status === "loading";
+  const isInitialLoading = true;
   const showError = status === "error";
 
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center my-3"
>
  <div
    class="spinner-border spinner-border-sm"
    role="status"

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:103:21
     : [];
 
   const isInitialLoading = status === "loading";
-  const showError = status === "error";
+  const showError = false;
 
   return (
killedBy: ChatHistoryPage shows error message when chat query fails
statusReason: Unable to find an element with the text: /Unable to load chat messages/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/ChatHistoryPage.jsx:103:21
     : [];
 
   const isInitialLoading = status === "loading";
-  const showError = status === "error";
+  const showError = status !== "error";
 
   return (
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-danger my-3"
>
  Unable to load chat messages.
</div> instead

[Killed] ArrowFunction
src/main/pages/ChatHistoryPage.jsx:111:20
         <Button
           variant="secondary"
           className="mb-3"
-          onClick={() => navigate(-1)}
+          onClick={() => undefined}
           data-testid="ChatHistoryPage-back"
         >
killedBy: ChatHistoryPage clicking back navigates to previous page
statusReason: expected "spy" to be called with arguments: [ -1 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] UnaryOperator
src/main/pages/ChatHistoryPage.jsx:111:35
         <Button
           variant="secondary"
           className="mb-3"
-          onClick={() => navigate(-1)}
+          onClick={() => navigate(+1)}
           data-testid="ChatHistoryPage-back"
         >
killedBy: ChatHistoryPage clicking back navigates to previous page
statusReason: expected "spy" to be called with arguments: [ -1 ]

Received: 

  1st spy call:

  [
-   -1,

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:126:24
         <div
           style={{
             minHeight: "50vh",
-            maxHeight: "70vh",
+            maxHeight: "",
             overflowY: "auto",
             border: "1px solid #dee2e6",
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- max-height: 70vh;

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:129:27
             maxHeight: "70vh",
             overflowY: "auto",
             border: "1px solid #dee2e6",
-            borderRadius: "0.5rem",
+            borderRadius: "",
             padding: "1rem",
             backgroundColor: "white",
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- border-radius: 0.5rem;

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:135:12
           }}
           data-testid="ChatHistoryPage-message-container"
         >
-          {isInitialLoading && (
-            <div className="text-center my-3">
-              <Spinner animation="border" role="status" size="sm" /> Loading
-              messages...
-            </div>
-          )}
+          {isInitialLoading || <div className="text-center my-3">
+              <Spinner animation="border" role="status" size="sm" /> Loading
+              messages...
+            </div>}
           {showError && (
             <div className="text-center text-danger my-3">
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center my-3"
>
  <div
    class="spinner-border spinner-border-sm"
    role="status"

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:135:12
           }}
           data-testid="ChatHistoryPage-message-container"
         >
-          {isInitialLoading && (
-            <div className="text-center my-3">
-              <Spinner animation="border" role="status" size="sm" /> Loading
-              messages...
-            </div>
-          )}
+          {false}
           {showError && (
             <div className="text-center text-danger my-3">
killedBy: ChatHistoryPage shows loading indicator while initial messages fetch
statusReason: Unable to find an element with the text: /Loading messages.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:141:12
               messages...
             </div>
           )}
-          {showError && (
-            <div className="text-center text-danger my-3">
-              Unable to load chat messages.
-            </div>
-          )}
+          {true}
           {!isInitialLoading && messages.length === 0 && (
             <div className="text-center text-muted my-3">
killedBy: ChatHistoryPage shows error message when chat query fails
statusReason: Unable to find an element with the text: /Unable to load chat messages/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:141:12
               messages...
             </div>
           )}
-          {showError && (
-            <div className="text-center text-danger my-3">
-              Unable to load chat messages.
-            </div>
-          )}
+          {showError || <div className="text-center text-danger my-3">
+              Unable to load chat messages.
+            </div>}
           {!isInitialLoading && messages.length === 0 && (
             <div className="text-center text-muted my-3">
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-danger my-3"
>
  Unable to load chat messages.
</div> instead

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:146:12
               Unable to load chat messages.
             </div>
           )}
-          {!isInitialLoading && messages.length === 0 && (
-            <div className="text-center text-muted my-3">
-              No messages available for this commons.
-            </div>
-          )}
+          {false}
           {messages.map((message) => (
             <ChatMessageDisplay key={message.id} message={message} />
killedBy: ChatHistoryPage shows empty state when there are no messages after loading
statusReason: Unable to find an element with the text: /No messages available for this commons/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:146:12
               Unable to load chat messages.
             </div>
           )}
-          {!isInitialLoading && messages.length === 0 && (
+          {!isInitialLoading || messages.length === 0 && (
             <div className="text-center text-muted my-3">
               No messages available for this commons.
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-muted my-3"
>
  No messages available for this commons.
</div> instead

[Killed] ArrowFunction
src/main/pages/ChatHistoryPage.jsx:151:25
               No messages available for this commons.
             </div>
           )}
-          {messages.map((message) => (
-            <ChatMessageDisplay key={message.id} message={message} />
-          ))}
+          {messages.map(() => undefined)}
           <div
             ref={loadMoreRef}
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:160:17
             data-testid="ChatHistoryPage-status"
           >
             {isFetchingNextPage
-              ? "Loading more messages..."
+              ? ""
               : hasNextPage
                 ? "Scroll to load more messages"
killedBy: ChatHistoryPage status indicator shows loading text while fetching next page
statusReason: Unable to find an element with the text: /Loading more messages/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:166:10
                 : "[no more messages]"}
           </div>
         </div>
-        {isFetching && !isFetchingNextPage && (
-          <div className="text-center text-muted mt-2">
-            Updating conversation...
-          </div>
-        )}
+        {isFetching && !isFetchingNextPage || <div className="text-center text-muted mt-2">
+            Updating conversation...
+          </div>}
       </div>
     </BasicLayout>
killedBy: ChatHistoryPage shows updating indicator when refreshing current messages
statusReason: Unable to find an element with the text: /Updating conversation/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:166:10
                 : "[no more messages]"}
           </div>
         </div>
-        {isFetching && !isFetchingNextPage && (
-          <div className="text-center text-muted mt-2">
-            Updating conversation...
-          </div>
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: ChatHistoryPage shows updating indicator when refreshing current messages
statusReason: Unable to find an element with the text: /Updating conversation/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
