[Killed] BlockStatement
src/main/utils/courseUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/course",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: courseUtils tests cellToAxiosParamsDelete returns correct axios params
statusReason: expected undefined to deeply equal { url: '/api/course', …(2) }

[Killed] StringLiteral
src/main/utils/courseUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/course",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: courseUtils tests cellToAxiosParamsDelete returns correct axios params
statusReason: expected { Object (url, method, ...) } to deeply equal { url: '/api/course', …(2) }
