[Killed] BlockStatement
src/main/utils/currentUser.js:9:17
   let rolesList = ["ERROR_GETTING_ROLES"];
   return useQuery(
     "/api/currentUser",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null };
-      }
-    },
+    async () => {},
     {
       initialData: {
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/main/utils/currentUser.js:10:11
   return useQuery(
     "/api/currentUser",
     async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
+      try {} catch (e) {
         console.error("Error invoking axios.get: ", e);
         return { loggedIn: false, root: null };
killedBy: ChatDisplay tests displays one message correctly without usernames
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1-User"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/main/utils/currentUser.js:26:19
     },
     {
       initialData: {
-        loggedIn: false,
+        loggedIn: true,
         root: null,
       },
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/main/utils/currentUser.js:33:29
   );
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("/api/currentUser", { exact: true });
-    navigate("/");
-  });
-  return mutation;
-}
+export function useLogout() {}
 
 export function hasRole(currentUser, role) {
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: expected "useNavigate" to be called at least once

[Killed] BlockStatement
src/main/utils/currentUser.js:36:44
 export function useLogout() {
   const queryClient = useQueryClient();
   const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("/api/currentUser", { exact: true });
-    navigate("/");
-  });
+  const mutation = useMutation(async () => {});
   return mutation;
 }
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: expected "spy" to be called with arguments: [ '/' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/main/utils/currentUser.js:38:65
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
     await axios.post("/logout");
-    await queryClient.resetQueries("/api/currentUser", { exact: true });
+    await queryClient.resetQueries("/api/currentUser", { exact: false });
     navigate("/");
   });
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: expected "resetQueries" to be called with arguments: [ '/api/currentUser', { exact: true } ]

Received: 

  1st resetQueries call:

  [
    "/api/currentUser",

[Killed] BlockStatement
src/main/utils/currentUser.js:44:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  return (
-    currentUser &&
-    currentUser.loggedIn &&
-    currentUser.root &&
-    currentUser.root.rolesList &&
-    currentUser.root.rolesList.includes(role)
-  );
-}
+export function hasRole(currentUser, role) {}
 
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/main/utils/currentUser.js:46:5
 
 export function hasRole(currentUser, role) {
   return (
-    currentUser &&
-    currentUser.loggedIn &&
-    currentUser.root &&
-    currentUser.root.rolesList &&
-    currentUser.root.rolesList.includes(role)
+    false
   );
 }
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: expected false to be truthy

[Killed] LogicalOperator
src/main/utils/currentUser.js:46:5
 
 export function hasRole(currentUser, role) {
   return (
-    currentUser &&
-    currentUser.loggedIn &&
+    currentUser || currentUser.loggedIn &&
     currentUser.root &&
     currentUser.root.rolesList &&
killedBy: CoursesTable tests Hides action buttons when currentUser is null
statusReason: Cannot read properties of null (reading 'loggedIn')
