[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery(
-    "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {
-          springH2ConsoleEnabled: false,
-          showSwaggerUILink: false,
-        };
-      }
-    },
-    {
-      initialData: () => ({
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      }),
-    },
-  );
-}
+export function useSystemInfo() {}
 
killedBy: PlayPage tests renders without crashing
statusReason: Cannot destructure property 'data' of '(0 , useSystemInfo)(...)' as it is undefined.

[Killed] StringLiteral
src/main/utils/systemInfo.js:6:5
 
 export function useSystemInfo() {
   return useQuery(
-    "systemInfo",
+    "",
     async () => {
       try {
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/main/utils/systemInfo.js:7:17
 export function useSystemInfo() {
   return useQuery(
     "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {
-          springH2ConsoleEnabled: false,
-          showSwaggerUILink: false,
-        };
-      }
-    },
+    async () => {},
     {
       initialData: () => ({
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: expected 3 to be greater than or equal to 4

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/utils/systemInfo.js:8:11
   return useQuery(
     "systemInfo",
     async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
+      try {} catch (e) {
         console.error("Error invoking axios.get: ", e);
         return {
killedBy: LeaderboardPage tests renders leaderboard for users when showLeaderboard = true
statusReason: expected 3 to deeply equal 4

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/utils/systemInfo.js:11:19
       try {
         const response = await axios.get("/api/systemInfo");
         return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {
-          springH2ConsoleEnabled: false,
-          showSwaggerUILink: false,
-        };
-      }
+      } catch (e) {}
     },
     {
killedBy: utils/systemInfo tests useSystemInfo tests systemInfo when API unreachable
statusReason: expected "error" to be called at least once

[Killed] ObjectLiteral
src/main/utils/systemInfo.js:19:5
         };
       }
     },
-    {
-      initialData: () => ({
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      }),
-    },
+    {},
   );
 }
killedBy: LoginPage tests renders without crashing when lists return empty list
statusReason: Cannot read properties of undefined (reading 'oauthLogin')

[Killed] ArrowFunction
src/main/utils/systemInfo.js:20:20
       }
     },
     {
-      initialData: () => ({
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      }),
+      initialData: () => undefined,
     },
   );
killedBy: LoginPage tests renders without crashing when lists return empty list
statusReason: Cannot read properties of undefined (reading 'oauthLogin')

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:21:33
     },
     {
       initialData: () => ({
-        springH2ConsoleEnabled: false,
+        springH2ConsoleEnabled: true,
         showSwaggerUILink: false,
       }),
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: expected true to be false // Object.is equality
