[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery(
-    "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
-    {
-      initialData: () => ({
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      }),
-    },
-  );
-}
+export function useSystemInfo() {}
 
killedBy: PlayPage tests renders without crashing
statusReason: Cannot destructure property 'data' of '(0 , useSystemInfo)(...)' as it is undefined.
