[Killed] StringLiteral
main/components/Commons/CommonsOverview.jsx:30:28
         <Row>
           <Col>
             <Card.Title>
-              Today is day{" "}
+              Today is day{""}
               {daysSinceTimestamp(commonsPlus.commons.startingDate)}!
             </Card.Title>
killedBy: CommonsOverview tests renders the correct day
statusReason: Unable to find an element with the text: /Today is day /i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
