[Killed] StringLiteral
main/components/Courses/CoursesForm.jsx:42:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="code">Code</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-code"}
+          data-testid={testIdPrefix + ""}
           id="code"
           type="text"
killedBy: CoursesForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="CoursesForm-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.jsx:46:32
           id="code"
           type="text"
           isInvalid={Boolean(errors.code)}
-          {...register("code", {
-            required: "Code is required.",
-          })}
+          {...register("code", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests that the correct validations are performed
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/Courses/CoursesForm.jsx:91:8
       >
         {buttonLabel}
       </Button>
-      {!cancelDisabled && (
-        <Button
-          variant="Secondary"
-          onClick={() => navigate(-1)}
-          // Stryker disable next-line all
-          data-testid={testIdPrefix + "-cancel"}
-        >
-          Cancel
-        </Button>
-      )}
+      {!cancelDisabled || <Button variant="Secondary" onClick={() => navigate(-1)}
+// Stryker disable next-line all
+data-testid={testIdPrefix + "-cancel"}>
+          Cancel
+        </Button>}
     </Form>
   );
killedBy: CoursesForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Unable to find an element by: [data-testid="CoursesForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
