[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:30:12
   });
 
   const USD = new Intl.NumberFormat("en-US", {
-    style: "currency",
+    style: "",
     currency: "USD",
   });
killedBy: DashboardPage as admin renders dashboard with overview, admin controls, and all sections
statusReason: Unable to find role="heading" and name `/test game 7/i`

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.jsx:35:5
   });
 
   const columns = [
-    {
-      Header: "Farmer",
-      accessor: (row, _rowIndex) => {
-        const url = `/admin/play/${row.gameId}/user/${row.userId}`;
-        return <Link to={url}>{row.username}</Link>;
-      },
-    },
+    {},
     ...(isAdminView && isCourseLinkedGame
       ? [
killedBy: DashboardPage as admin renders dashboard with overview, admin controls, and all sections
statusReason: Unable to find role="heading" and name `/test game 7/i`

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.jsx:37:37
   const columns = [
     {
       Header: "Farmer",
-      accessor: (row, _rowIndex) => {
-        const url = `/admin/play/${row.gameId}/user/${row.userId}`;
-        return <Link to={url}>{row.username}</Link>;
-      },
+      accessor: (row, _rowIndex) => {},
     },
     ...(isAdminView && isCourseLinkedGame
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  one
Received:

[Killed] LogicalOperator
main/components/Leaderboard/LeaderboardTable.jsx:42:9
         return <Link to={url}>{row.username}</Link>;
       },
     },
-    ...(isAdminView && isCourseLinkedGame
+    ...(isAdminView || isCourseLinkedGame
       ? [
           {
killedBy: LeaderboardTable tests Activity column is hidden when isAdminView is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
  data-testid="LeaderboardTable-header-Activity"
  role="columnheader"
  style="cursor: pointer;"
  title="Toggle SortBy"

[Killed] ConditionalExpression
main/components/Leaderboard/LeaderboardTable.jsx:42:9
         return <Link to={url}>{row.username}</Link>;
       },
     },
-    ...(isAdminView && isCourseLinkedGame
+    ...(true
       ? [
           {
killedBy: DashboardPage as admin hides the leaderboard's Activity column when the game is not linked to a course
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
  data-testid="LeaderboardTable-header-Activity"
  role="columnheader"
  style="cursor: pointer;"
  title="Toggle SortBy"

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.jsx:46:43
       ? [
           {
             Header: "Activity",
-            accessor: (row, _rowIndex) => {
-              if (!row.student) {
-                return (
-                  <span
-                    data-testid={`LeaderboardTable-cell-row-${_rowIndex}-col-Activity-not-a-student`}
-                  >
-                    Not a student
-                  </span>
-                );
-              }
-              const url = `/admin/farmeractivity/${row.gameId}/user/${row.userId}`;
-              return (
-                <Button
-                  as={Link}
-                  to={url}
-                  variant="outline-secondary"
-                  size="sm"
-                  data-testid={`LeaderboardTable-cell-row-${_rowIndex}-col-Activity-button`}
-                >
-                  Activity
-                </Button>
-              );
-            },
+            accessor: (row, _rowIndex) => {},
           },
         ]
killedBy: LeaderboardTable tests Activity column shows a button linking to the correct URL for a student farmer
statusReason: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-Activity-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.jsx:47:33
           {
             Header: "Activity",
             accessor: (row, _rowIndex) => {
-              if (!row.student) {
-                return (
-                  <span
-                    data-testid={`LeaderboardTable-cell-row-${_rowIndex}-col-Activity-not-a-student`}
-                  >
-                    Not a student
-                  </span>
-                );
-              }
+              if (!row.student) {}
               const url = `/admin/farmeractivity/${row.gameId}/user/${row.userId}`;
               return (
killedBy: LeaderboardTable tests Activity column shows "Not a student" for a non-student farmer
statusReason: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-Activity-not-a-student"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ConditionalExpression
main/components/Leaderboard/LeaderboardTable.jsx:47:19
           {
             Header: "Activity",
             accessor: (row, _rowIndex) => {
-              if (!row.student) {
+              if (true) {
                 return (
                   <span
killedBy: LeaderboardTable tests Activity column shows a button linking to the correct URL for a student farmer
statusReason: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-Activity-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:56:27
                   </span>
                 );
               }
-              const url = `/admin/farmeractivity/${row.gameId}/user/${row.userId}`;
+              const url = ``;
               return (
                 <Button
killedBy: LeaderboardTable tests Activity column shows a button linking to the correct URL for a student farmer
statusReason: expect(element).toHaveAttribute("href", "/admin/farmeractivity/1/user/1") // element.getAttribute("href") === "/admin/farmeractivity/1/user/1"

Expected the element to have attribute:
  href="/admin/farmeractivity/1/user/1"
Received:
  href="/"

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:63:32
                   to={url}
                   variant="outline-secondary"
                   size="sm"
-                  data-testid={`LeaderboardTable-cell-row-${_rowIndex}-col-Activity-button`}
+                  data-testid={``}
                 >
                   Activity
killedBy: LeaderboardTable tests Activity column shows a button linking to the correct URL for a student farmer
statusReason: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-Activity-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.jsx:72:5
           },
         ]
       : []),
-    {
-      Header: "Total Wealth",
-      accessor: "totalWealth",
-      Cell: (props) => {
-        return (
-          <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>
-        );
-      },
-    },
+    {},
     {
       Header: "Cows Owned",
killedBy: DashboardPage as admin renders dashboard with overview, admin controls, and all sections
statusReason: Unable to find role="heading" and name `/test game 7/i`

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.jsx:91:24
     {
       Header: "Cow Health",
       accessor: "cowHealth",
-      Cell: (props) => {
-        return (
-          <div style={{ textAlign: "right" }}>
-            {typeof props.value === "number"
-              ? props.value.toFixed(2)
-              : props.value}
-          </div>
-        );
-      },
+      Cell: (props) => {},
     },
     {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  93.50
Received:

[Killed] ConditionalExpression
main/components/Leaderboard/LeaderboardTable.jsx:94:14
       Cell: (props) => {
         return (
           <div style={{ textAlign: "right" }}>
-            {typeof props.value === "number"
+            {false
               ? props.value.toFixed(2)
               : props.value}
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  93.50
Received:
  93.49999962515619

[Killed] EqualityOperator
main/components/Leaderboard/LeaderboardTable.jsx:94:14
       Cell: (props) => {
         return (
           <div style={{ textAlign: "right" }}>
-            {typeof props.value === "number"
+            {typeof props.value !== "number"
               ? props.value.toFixed(2)
               : props.value}
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.jsx:132:17
         value={pageSize}
         onChange={handlePageSizeChange}
         options={PAGE_SIZE_OPTIONS}
-        testid={`${testid}-page-size-selector`}
+        testid={``}
       />
       <OurTable
killedBy: LeaderboardTable tests defaults to a page size of 20 when nothing is stored in localStorage
statusReason: Unable to find an element by: [data-testid="LeaderboardTable-page-size-selector"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >
