[Killed] StringLiteral
main/components/Reports/ReportLineTable.jsx:25:17
     },
     {
       Header: "Username",
-      accessor: "username",
+      accessor: "",
     },
     {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-username"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.jsx:27:5
       Header: "Username",
       accessor: "username",
     },
-    {
-      Header: "Total Wealth",
-      accessor: "totalWealth",
-      Cell: (props) => {
-        return (
-          <div style={{ textAlign: "right" }}>
-            {formatter.format(props.value)}
-          </div>
-        );
-      },
-    },
+    {},
     {
       Header: "Num Cows",
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.jsx:73:5
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
       },
     },
-    {
-      Header: "Create Date",
-      accessor: "createDate",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
   ];
 
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: A column ID (or string accessor) is required!
