[Killed] StringLiteral
main/components/Students/StudentsTable.jsx:25:12
   students,
   currentUser,
   courseId,
-  testid = "StudentsTable",
+  testid = "",
 }) {
   const [showDeleteModal, setShowDeleteModal] = useState(false);
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:29:54
 }) {
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [cellToDelete, setCellToDelete] = useState(null);
-  const [showEditModal, setShowEditModal] = useState(false);
+  const [showEditModal, setShowEditModal] = useState(true);
   const [studentToEdit, setStudentToEdit] = useState(null);
   const [pageSize, handlePageSizeChange] = usePageSize({
killedBy: StudentsTable tests Has the expected column headers and content for admin user
statusReason: Found multiple elements with the text: Last Name

Here are the matching elements:

Ignored nodes: comments, script, style
<th
  colspan="1"
  data-testid="StudentsTable-header-lastName"

[Killed] BlockStatement
main/components/Students/StudentsTable.jsx:39:34
 
   const queryKey = [`/api/student/course/${courseId}`];
 
-  const editCallback = (cell) => {
-    setStudentToEdit(cell.row.original);
-    setShowEditModal(true);
-  };
+  const editCallback = (cell) => {};
 
   const cellToAxiosParamsEdit = (student) => ({
killedBy: StudentsTable tests Exiting the edit modal pop up cancels the edit
statusReason: Unable to find an element by: [data-testid="StudentsTable-EditModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:41:22
 
   const editCallback = (cell) => {
     setStudentToEdit(cell.row.original);
-    setShowEditModal(true);
+    setShowEditModal(false);
   };
 
killedBy: StudentsTable tests Exiting the edit modal pop up cancels the edit
statusReason: Unable to find an element by: [data-testid="StudentsTable-EditModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ArrowFunction
main/components/Students/StudentsTable.jsx:44:33
     setShowEditModal(true);
   };
 
-  const cellToAxiosParamsEdit = (student) => ({
-    url: `/api/student/${studentToEdit.id}`,
-    method: "PUT",
-    data: { ...student, courseId },
-  });
+  const cellToAxiosParamsEdit = () => undefined;
 
   const onEditSuccess = () => {
killedBy: StudentsTable tests Edit button opens a pre-filled modal, and submitting PUTs with courseId merged in
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Students/StudentsTable.jsx:50:31
     data: { ...student, courseId },
   });
 
-  const onEditSuccess = () => {
-    toast("Student updated successfully.");
-    setShowEditModal(false);
-  };
+  const onEditSuccess = () => {};
 
   const editMutation = useBackendMutation(
killedBy: StudentsTable tests Edit button opens a pre-filled modal, and submitting PUTs with courseId merged in
statusReason: expected "spy" to be called with arguments: [ 'Student updated successfully.' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:52:22
 
   const onEditSuccess = () => {
     toast("Student updated successfully.");
-    setShowEditModal(false);
+    setShowEditModal(true);
   };
 
killedBy: StudentsTable tests Edit button opens a pre-filled modal, and submitting PUTs with courseId merged in
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Students/StudentsTable.jsx:71:42
     queryKey,
   );
 
-  const deleteCallback = async (cell) => {
-    setCellToDelete(cell);
-    setShowDeleteModal(true);
-  };
+  const deleteCallback = async (cell) => {};
 
   const confirmDelete = async (cell) => {
killedBy: StudentsTable tests Delete button calls delete callback
statusReason: Unable to find an element by: [data-testid="StudentsTable-Modal-Delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:73:24
 
   const deleteCallback = async (cell) => {
     setCellToDelete(cell);
-    setShowDeleteModal(true);
+    setShowDeleteModal(false);
   };
 
killedBy: StudentsTable tests Delete button calls delete callback
statusReason: Unable to find an element by: [data-testid="StudentsTable-Modal-Delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] BlockStatement
main/components/Students/StudentsTable.jsx:76:41
     setShowDeleteModal(true);
   };
 
-  const confirmDelete = async (cell) => {
-    deleteMutation.mutate(cell);
-    setShowDeleteModal(false);
-  };
+  const confirmDelete = async (cell) => {};
 
   const columns = [
killedBy: StudentsTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:78:24
 
   const confirmDelete = async (cell) => {
     deleteMutation.mutate(cell);
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
   };
 
killedBy: StudentsTable tests Delete button calls delete callback
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Students/StudentsTable.jsx:88:17
     },
     {
       Header: "Last Name",
-      accessor: "lastName",
+      accessor: "",
     },
     {
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-lastName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ObjectLiteral
main/components/Students/StudentsTable.jsx:90:5
       Header: "Last Name",
       accessor: "lastName",
     },
-    {
-      Header: "First/Middle Name",
-      accessor: "firstMiddleName",
-    },
+    {},
     {
       Header: "Email",
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Students/StudentsTable.jsx:100:17
     },
     {
       Header: "Perm",
-      accessor: "perm",
+      accessor: "",
     },
     {
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="StudentsTable-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] StringLiteral
main/components/Students/StudentsTable.jsx:103:15
       accessor: "perm",
     },
     {
-      Header: "Last Login",
+      Header: "",
       accessor: "lastLoginDateTime",
       Cell: ({ value }) => (value ? formatTime(value) : "Never"),
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Last Login. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ArrowFunction
main/components/Students/StudentsTable.jsx:105:13
     {
       Header: "Last Login",
       accessor: "lastLoginDateTime",
-      Cell: ({ value }) => (value ? formatTime(value) : "Never"),
+      Cell: () => undefined,
     },
   ];
killedBy: StudentsTable tests displays formatted last login time, and 'Never' when null
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Never
Received:

[Killed] StringLiteral
main/components/Students/StudentsTable.jsx:105:57
     {
       Header: "Last Login",
       accessor: "lastLoginDateTime",
-      Cell: ({ value }) => (value ? formatTime(value) : "Never"),
+      Cell: ({ value }) => (value ? formatTime(value) : ""),
     },
   ];
killedBy: StudentsTable tests displays formatted last login time, and 'Never' when null
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Never
Received:

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:133:27
           initialContents={studentToEdit}
           submitAction={submitEditForm}
           buttonLabel="Update"
-          cancelDisabled={true}
+          cancelDisabled={false}
         />
       </Modal.Body>
killedBy: StudentsTable tests Exiting the edit modal pop up cancels the edit
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-Secondary"
  data-testid="StudentsForm-cancel"
  type="button"
>
  Cancel

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:153:45
         <Button
           variant="secondary"
           data-testid="StudentsTable-Modal-Cancel"
-          onClick={() => setShowDeleteModal(false)}
+          onClick={() => setShowDeleteModal(true)}
         >
           Keep this Student
killedBy: StudentsTable tests Pressing Keep this Student in Modal cancels the deletion
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Students/StudentsTable.jsx:153:20
         <Button
           variant="secondary"
           data-testid="StudentsTable-Modal-Cancel"
-          onClick={() => setShowDeleteModal(false)}
+          onClick={() => undefined}
         >
           Keep this Student
killedBy: StudentsTable tests Pressing Keep this Student in Modal cancels the deletion
statusReason: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Students/StudentsTable.jsx:160:20
         <Button
           variant="danger"
           data-testid="StudentsTable-Modal-Delete"
-          onClick={() => confirmDelete(cellToDelete)}
+          onClick={() => undefined}
         >
           Permanently Delete
killedBy: StudentsTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BooleanLiteral
main/components/Students/StudentsTable.jsx:180:19
         data={students}
         columns={columnsToDisplay}
         testid={testid}
-        centered={false}
+        centered={true}
         pageSize={pageSize}
       />
killedBy: StudentsTable tests renders the table flush left, not centered
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- margin: 0px;
+ margin: 0px auto;

[Killed] LogicalOperator
main/components/Students/StudentsTable.jsx:183:8
         centered={false}
         pageSize={pageSize}
       />
-      {hasRole(currentUser, "ROLE_ADMIN") && editModal}
+      {hasRole(currentUser, "ROLE_ADMIN") || editModal}
       {hasRole(currentUser, "ROLE_ADMIN") && studentsModal}
     </>
killedBy: StudentsTable tests Exiting the edit modal pop up cancels the edit
statusReason: Unable to find an element by: [data-testid="StudentsTable-EditModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ConditionalExpression
main/components/Students/StudentsTable.jsx:183:8
         centered={false}
         pageSize={pageSize}
       />
-      {hasRole(currentUser, "ROLE_ADMIN") && editModal}
+      {true}
       {hasRole(currentUser, "ROLE_ADMIN") && studentsModal}
     </>
killedBy: StudentsTable tests Exiting the edit modal pop up cancels the edit
statusReason: Unable to find an element by: [data-testid="StudentsTable-EditModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] ConditionalExpression
main/components/Students/StudentsTable.jsx:184:8
         pageSize={pageSize}
       />
       {hasRole(currentUser, "ROLE_ADMIN") && editModal}
-      {hasRole(currentUser, "ROLE_ADMIN") && studentsModal}
+      {true}
     </>
   );
killedBy: StudentsTable tests Delete button calls delete callback
statusReason: Unable to find an element by: [data-testid="StudentsTable-Modal-Delete"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
main/components/Students/StudentsTable.jsx:184:8
         pageSize={pageSize}
       />
       {hasRole(currentUser, "ROLE_ADMIN") && editModal}
-      {hasRole(currentUser, "ROLE_ADMIN") && studentsModal}
+      {hasRole(currentUser, "ROLE_ADMIN") || studentsModal}
     </>
   );
killedBy: StudentsTable tests Delete button calls delete callback
statusReason: Unable to find an element by: [data-testid="StudentsTable-Modal-Delete"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
