[Killed] BlockStatement
src/main/utils/usePageSize.js:11:4
   storageKey,
   options = [20, 50, 100, 200, 500],
   defaultPageSize = 20,
-}) {
-  const getInitialPageSize = () => {
-    const storedValue = parseInt(localStorage.getItem(storageKey), 10);
-    if (options.includes(storedValue)) {
-      return storedValue;
-    }
-    localStorage.setItem(storageKey, defaultPageSize);
-    return defaultPageSize;
-  };
-
-  const [pageSize, setPageSize] = useState(getInitialPageSize);
-
-  const handlePageSizeChange = (newPageSize) => {
-    setPageSize(newPageSize);
-    localStorage.setItem(storageKey, newPageSize);
-  };
-
-  return [pageSize, handlePageSizeChange];
-}
+}) {}
 
killedBy: StudentsTable tests Has the expected column headers and content for ordinary user
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/main/utils/usePageSize.js:12:36
   options = [20, 50, 100, 200, 500],
   defaultPageSize = 20,
 }) {
-  const getInitialPageSize = () => {
-    const storedValue = parseInt(localStorage.getItem(storageKey), 10);
-    if (options.includes(storedValue)) {
-      return storedValue;
-    }
-    localStorage.setItem(storageKey, defaultPageSize);
-    return defaultPageSize;
-  };
+  const getInitialPageSize = () => {};
 
   const [pageSize, setPageSize] = useState(getInitialPageSize);
killedBy: StudentsTable tests renders a Page Size selector defaulting to 100
statusReason: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  20

[Killed] ConditionalExpression
src/main/utils/usePageSize.js:14:9
 }) {
   const getInitialPageSize = () => {
     const storedValue = parseInt(localStorage.getItem(storageKey), 10);
-    if (options.includes(storedValue)) {
+    if (false) {
       return storedValue;
     }
killedBy: StudentsTable tests uses the page size stored in localStorage when it is a valid option
statusReason: expect(element).toHaveValue(20)

Expected the element to have value:
  20
Received:
  100

[Killed] ConditionalExpression
src/main/utils/usePageSize.js:14:9
 }) {
   const getInitialPageSize = () => {
     const storedValue = parseInt(localStorage.getItem(storageKey), 10);
-    if (options.includes(storedValue)) {
+    if (true) {
       return storedValue;
     }
killedBy: StudentsTable tests renders a Page Size selector defaulting to 100
statusReason: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  20

[Killed] BlockStatement
src/main/utils/usePageSize.js:23:49
 
   const [pageSize, setPageSize] = useState(getInitialPageSize);
 
-  const handlePageSizeChange = (newPageSize) => {
-    setPageSize(newPageSize);
-    localStorage.setItem(storageKey, newPageSize);
-  };
+  const handlePageSizeChange = (newPageSize) => {};
 
   return [pageSize, handlePageSizeChange];
killedBy: ReportLineTable tests selecting a page size stores it in localStorage under 'report-line-page-size'
statusReason: expected '20' to be '50' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
