[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:8:31
 
 const PAGE_SIZE_OPTIONS = [20, 50, 100, 200, 500];
 const DEFAULT_PAGE_SIZE = 20;
-const PAGE_SIZE_STORAGE_KEY = "reports-page-size";
+const PAGE_SIZE_STORAGE_KEY = "";
 
 // should take in a players list from a game
killedBy: ReportTable tests selecting a page size stores it in localStorage under 'reports-page-size'
statusReason: expected null to be '50' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Reports/ReportTable.jsx:20:56
 
   const navigate = useNavigate();
 
-  const [pageSize, handlePageSizeChange] = usePageSize({
-    storageKey: PAGE_SIZE_STORAGE_KEY,
-    options: PAGE_SIZE_OPTIONS,
-    defaultPageSize: DEFAULT_PAGE_SIZE,
-  });
+  const [pageSize, handlePageSizeChange] = usePageSize({});
 
   const reportCallback = (cell) => {
killedBy: ReportTable tests selecting a page size stores it in localStorage under 'reports-page-size'
statusReason: expected null to be '50' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:27:52
   });
 
   const reportCallback = (cell) => {
-    const route = `/admin/report/${cell.row.values["id"]}`;
+    const route = `/admin/report/${cell.row.values[""]}`;
     if (storybook) {
       window.alert(`would navigate to ${route}`);
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: expected "spy" to be called with arguments: [ '/admin/report/1' ]

Received: 

  1st spy call:

  [
-   "/admin/report/1",

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:28:20
 
   const reportCallback = (cell) => {
     const route = `/admin/report/${cell.row.values["id"]}`;
-    if (storybook) {
-      window.alert(`would navigate to ${route}`);
-    } else {
+    if (storybook) {} else {
       navigate(route);
     }
killedBy: ReportTable tests When on storybook, calls window.alert
statusReason: expected "bound " to be called with arguments: [ 'would navigate to /admin/report/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Reports/ReportTable.jsx:43:24
     {
       Header: "gameId",
       accessor: "gameId",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
+      Cell: (props) => {},
     },
     {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportTable.jsx:55:5
       Header: "Create Date",
       accessor: "createDate",
     },
-    {
-      Header: "Num Users",
-      accessor: "numUsers",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
     {
       Header: "Num Cows",
killedBy: ReportTable tests sorts by Create Date descending by default
statusReason: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Reports/ReportTable.jsx:62:5
         return <div style={{ textAlign: "right" }}>{props.value}</div>;
       },
     },
-    {
-      Header: "Num Cows",
-      accessor: "numCows",
-      Cell: (props) => {
-        return <div style={{ textAlign: "right" }}>{props.value}</div>;
-      },
-    },
+    {},
   ];
 
killedBy: ReportTable tests sorts by Create Date descending by default
statusReason: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/Reports/ReportTable.jsx:71:7
     },
   ];
 
-  if (buttons) {
+  if (false) {
     columns.push(
       ButtonColumn("View Report", "secondary", reportCallback, testid),
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-View Report-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex align-items-center gap-2 mt-2"
    >

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:73:20
 
   if (buttons) {
     columns.push(
-      ButtonColumn("View Report", "secondary", reportCallback, testid),
+      ButtonColumn("", "secondary", reportCallback, testid),
     );
   }
killedBy: ReportTable tests sorts by Create Date descending by default
statusReason: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Reports/ReportTable.jsx:77:45
     );
   }
 
-  const sortBy = [{ id: "createDate", desc: true }];
+  const sortBy = [{ id: "createDate", desc: false }];
 
   return (
killedBy: ReportTable tests sorts by Create Date descending by default
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] StringLiteral
main/components/Reports/ReportTable.jsx:77:25
     );
   }
 
-  const sortBy = [{ id: "createDate", desc: true }];
+  const sortBy = [{ id: "", desc: true }];
 
   return (
killedBy: ReportTable tests sorts by Create Date descending by default
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]
