[Killed] BooleanLiteral
main/components/Game/AdminGameCard.jsx:9:46
 import { hasRole } from "main/utils/currentUser";
 
 export default function AdminGameCard({ commonItem, currentUser }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [isHovered, setIsHovered] = useState(false);
   const navigate = useNavigate();
killedBy: AdminGameCard tests modal starts closed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminGameCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] ArrowFunction
main/components/Game/AdminGameCard.jsx:15:5
   const game = commonItem.game;
 
   const deleteMutation = useBackendMutation(
-    (commonItem) => ({
-      url: "/api/game",
-      method: "DELETE",
-      params: { id: commonItem.game.id },
-    }),
+    () => undefined,
     { onSuccess: onDeleteSuccess },
     ["/api/game/allplus"],
killedBy: AdminGameCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Game with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:16:12
 
   const deleteMutation = useBackendMutation(
     (commonItem) => ({
-      url: "/api/game",
+      url: "",
       method: "DELETE",
       params: { id: commonItem.game.id },
killedBy: AdminGameCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Game with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:17:15
   const deleteMutation = useBackendMutation(
     (commonItem) => ({
       url: "/api/game",
-      method: "DELETE",
+      method: "",
       params: { id: commonItem.game.id },
     }),
killedBy: AdminGameCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Game with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Game/AdminGameCard.jsx:18:15
     (commonItem) => ({
       url: "/api/game",
       method: "DELETE",
-      params: { id: commonItem.game.id },
+      params: {},
     }),
     { onSuccess: onDeleteSuccess },
killedBy: AdminGameCard tests modal delete button confirms deletion
statusReason: expected "spy" to be called with arguments: [ 'Game with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Game/AdminGameCard.jsx:24:28
     ["/api/game/allplus"],
   );
 
-  const handleEdit = () => {
-    navigate(`/admin/editgame/${game.id}`);
-  };
+  const handleEdit = () => {};
 
   const handleDelete = () => {
killedBy: AdminGameCard tests edit button navigates to edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/editgame/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:43:20
 
   const deleteModal = (
     <Modal
-      data-testid={`AdminGameCard-Modal-${game.id}`}
+      data-testid={``}
       show={showModal}
       onHide={() => setShowModal(false)}
killedBy: AdminGameCard tests delete button opens modal
statusReason: Unable to find an element by: [data-testid="AdminGameCard-Modal-1"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:54:24
       <Modal.Footer>
         <Button
           variant="secondary"
-          data-testid={`AdminGameCard-Modal-Cancel-${game.id}`}
+          data-testid={``}
           onClick={() => setShowModal(false)}
         >
killedBy: AdminGameCard tests modal cancel button closes modal
statusReason: Unable to find an element by: [data-testid="AdminGameCard-Modal-Cancel-1"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] ArrowFunction
main/components/Game/AdminGameCard.jsx:55:20
         <Button
           variant="secondary"
           data-testid={`AdminGameCard-Modal-Cancel-${game.id}`}
-          onClick={() => setShowModal(false)}
+          onClick={() => undefined}
         >
           Keep this Game
killedBy: AdminGameCard tests modal cancel button closes modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminGameCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Game/AdminGameCard.jsx:55:39
         <Button
           variant="secondary"
           data-testid={`AdminGameCard-Modal-Cancel-${game.id}`}
-          onClick={() => setShowModal(false)}
+          onClick={() => setShowModal(true)}
         >
           Keep this Game
killedBy: AdminGameCard tests modal cancel button closes modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog"
  data-testid="AdminGameCard-Modal-1"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:61:24
         </Button>
         <Button
           variant="danger"
-          data-testid={`AdminGameCard-Modal-Delete-${game.id}`}
+          data-testid={``}
           onClick={confirmDelete}
         >
killedBy: AdminGameCard tests modal delete button confirms deletion
statusReason: Unable to find an element by: [data-testid="AdminGameCard-Modal-Delete-1"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:223:28
               variant="info"
               size="sm"
               href={`/admin/announcements/${game.id}`}
-              data-testid={`AdminGameCard-Announcements-${game.id}`}
+              data-testid={``}
             >
               Announcements
killedBy: AdminGameCard tests announcements button has correct href
statusReason: Unable to find an element by: [data-testid="AdminGameCard-Announcements-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:230:21
             <Button
               variant="info"
               size="sm"
-              href={`/admin/chat/${game.id}`}
+              href={``}
               data-testid={`AdminGameCard-Chat-${game.id}`}
             >
killedBy: AdminGameCard tests chat button renders with correct href and testid
statusReason: expect(element).toHaveAttribute("href", "/admin/chat/1") // element.getAttribute("href") === "/admin/chat/1"

Expected the element to have attribute:
  href="/admin/chat/1"
Received:
  href=""

[Killed] LogicalOperator
main/components/Game/AdminGameCard.jsx:243:14
             >
               Dashboard
             </Button>
-            {game.courseId != null && (
-              <Button
-                variant="info"
-                size="sm"
-                href={`/admin/gameactivity/${game.id}`}
-                data-testid={`AdminGameCard-Activity-${game.id}`}
-              >
-                Activity
-              </Button>
-            )}
+            {game.courseId != null || <Button variant="info" size="sm" href={`/admin/gameactivity/${game.id}`} data-testid={`AdminGameCard-Activity-${game.id}`}>
+                Activity
+              </Button>}
           </div>
         </Card.Body>
killedBy: AdminGameCard tests activity button does not render for a game with no courseId
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-info btn-sm"
  data-testid="AdminGameCard-Activity-1"
  href="/admin/gameactivity/1"
  role="button"
  tabindex="0"

[Killed] EqualityOperator
main/components/Game/AdminGameCard.jsx:243:14
             >
               Dashboard
             </Button>
-            {game.courseId != null && (
+            {game.courseId == null && (
               <Button
                 variant="info"
killedBy: AdminGameCard tests activity button does not render for a game with no courseId
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-info btn-sm"
  data-testid="AdminGameCard-Activity-1"
  href="/admin/gameactivity/1"
  role="button"
  tabindex="0"

[Killed] StringLiteral
main/components/Game/AdminGameCard.jsx:247:23
               <Button
                 variant="info"
                 size="sm"
-                href={`/admin/gameactivity/${game.id}`}
+                href={``}
                 data-testid={`AdminGameCard-Activity-${game.id}`}
               >
killedBy: AdminGameCard tests activity button renders with correct href and testid for a game linked to a course
statusReason: expect(element).toHaveAttribute("href", "/admin/gameactivity/1") // element.getAttribute("href") === "/admin/gameactivity/1"

Expected the element to have attribute:
  href="/admin/gameactivity/1"
Received:
  href=""
