[Killed] BooleanLiteral
src/main/components/OurTable.jsx:24:14
   columns,
   data,
   testid = "testid",
-  centered = true,
+  centered = false,
   ...rest
 }) {
killedBy: OurTable tests table is centered by default
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- margin: 0px auto;
+ margin: 0px;

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:28:20
   ...rest
 }) {
   const [pageIndex, setPageIndex] = React.useState(0);
-  const pageSize = rest.pageSize || 10;
+  const pageSize = true;
 
   // If pageSize changes (e.g. the caller offers a page-size selector) while
killedBy: OurTable tests renders a table with 3 rows and tests that pagination isn't visible when there are less rows than rows per page
statusReason: expected <span class="page-link" …(1)>…(2)</span> to be null // Object.is equality

[Killed] BlockStatement
src/main/components/OurTable.jsx:34:25
   // we're on a page beyond what the new size would produce, staying put
   // would silently render an empty table - go back to the first page
   // instead.
-  React.useEffect(() => {
-    setPageIndex(0);
-  }, [pageSize]);
+  React.useEffect(() => {}, [pageSize]);
 
   const appliedTableStyle = centered
killedBy: OurTable tests changing pageSize while on a later page resets to the first page
statusReason: Unable to find an element with the text: Hello 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      data-testid="grow-page-size"
    >

[Killed] StringLiteral
src/main/components/OurTable.jsx:129:28
           <Pagination {...getTableProps()}>
             <Pagination.Prev
               onClick={() => setPageIndex(pageIndex - 1)}
-              data-testid={`${testid}-prev-page-button`}
+              data-testid={``}
               disabled={pageIndex === 0}
             />
killedBy: OurTable tests renders a table with 11 rows and tests that pagination is visible when there are more rows than rows per page
statusReason: Unable to find an element by: [data-testid="testid-prev-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] EqualityOperator
src/main/components/OurTable.jsx:151:14
                 {pageIndex - 2}
               </Pagination.Item>
             )}
-            {pageIndex > 1 && (
+            {pageIndex >= 1 && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 2)}
killedBy: OurTable tests renders a table with 51 rows and moving forward and back two pages
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality
