[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:37:46
 
   // *** SetCowHealth job ***
 
-  const objectToAxiosParamsSetCowHealthJob = (data) => ({
-    url: `/api/jobs/launch/setcowhealth?gameID=${data.selectedGame}&health=${data.healthValue}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsSetCowHealthJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:37:57
 
   // *** SetCowHealth job ***
 
-  const objectToAxiosParamsSetCowHealthJob = (data) => ({
-    url: `/api/jobs/launch/setcowhealth?gameID=${data.selectedGame}&health=${data.healthValue}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsSetCowHealthJob = (data) => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:38:10
   // *** SetCowHealth job ***
 
   const objectToAxiosParamsSetCowHealthJob = (data) => ({
-    url: `/api/jobs/launch/setcowhealth?gameID=${data.selectedGame}&health=${data.healthValue}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: expected '' to be '/api/jobs/launch/setcowhealth?gameID=…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:39:13
 
   const objectToAxiosParamsSetCowHealthJob = (data) => ({
     url: `/api/jobs/launch/setcowhealth?gameID=${data.selectedGame}&health=${data.healthValue}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:50:49
   );
   // Stryker restore all
 
-  const submitSetCowHealthJob = async (data) => {
-    toast(
-      `Submitted Job: Set Cow Health (Game: ${data.selectedGameName}, Health: ${data.healthValue})`,
-    );
-    SetCowHealthMutation.mutate(data);
-  };
+  const submitSetCowHealthJob = async (data) => {};
 
   // *** UpdateCowHealth job ***
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:52:7
 
   const submitSetCowHealthJob = async (data) => {
     toast(
-      `Submitted Job: Set Cow Health (Game: ${data.selectedGameName}, Health: ${data.healthValue})`,
+      ``,
     );
     SetCowHealthMutation.mutate(data);
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Set Cow Health (Game: Anika's Game, Health: 10)",

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:64:55
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
-    url: `/api/jobs/launch/updatecowhealthsinglegame?gameId=${data.selectedGame}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCowHealthJobSingle = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:65:10
   });
 
   const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
-    url: `/api/jobs/launch/updatecowhealthsinglegame?gameId=${data.selectedGame}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected '' to be '/api/jobs/launch/updatecowhealthsingl…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:83:52
   );
   // Stryker restore all
 
-  const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedGameName === "All Games") {
-      toast("Submitted Job: Update Cow Health");
-      UpdateCowHealthMutation.mutate();
-    } else {
-      toast(
-        `Submitted Job: Update Cow Health (Game: ${data.selectedGameName})`,
-      );
-      UpdateCowHealthSingleMutation.mutate(data);
-    }
-  };
+  const submitUpdateCowHealthJob = async (data) => {};
   // *** RecordGameStats job ***
   const objectToAxiosParamsRecordGameStatsJob = () => ({
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:84:48
   // Stryker restore all
 
   const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedGameName === "All Games") {
-      toast("Submitted Job: Update Cow Health");
-      UpdateCowHealthMutation.mutate();
-    } else {
+    if (data.selectedGameName === "All Games") {} else {
       toast(
         `Submitted Job: Update Cow Health (Game: ${data.selectedGameName})`,
killedBy: AdminJobsPage tests user can submit update cow health job for all game
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/main/pages/AdminJobsPage.jsx:84:9
   // Stryker restore all
 
   const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedGameName === "All Games") {
+    if (data.selectedGameName !== "All Games") {
       toast("Submitted Job: Update Cow Health");
       UpdateCowHealthMutation.mutate();
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected '/api/jobs/launch/updatecowhealth' to be '/api/jobs/launch/updatecowhealthsingl…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:85:13
 
   const submitUpdateCowHealthJob = async (data) => {
     if (data.selectedGameName === "All Games") {
-      toast("Submitted Job: Update Cow Health");
+      toast("");
       UpdateCowHealthMutation.mutate();
     } else {
killedBy: AdminJobsPage tests user can submit update cow health job for all game
statusReason: expected "spy" to be called with arguments: [ 'Submitted Job: Update Cow Health' ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Update Cow Health",

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:87:12
     if (data.selectedGameName === "All Games") {
       toast("Submitted Job: Update Cow Health");
       UpdateCowHealthMutation.mutate();
-    } else {
-      toast(
-        `Submitted Job: Update Cow Health (Game: ${data.selectedGameName})`,
-      );
-      UpdateCowHealthSingleMutation.mutate(data);
-    }
+    } else {}
   };
   // *** RecordGameStats job ***
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:89:9
       UpdateCowHealthMutation.mutate();
     } else {
       toast(
-        `Submitted Job: Update Cow Health (Game: ${data.selectedGameName})`,
+        ``,
       );
       UpdateCowHealthSingleMutation.mutate(data);
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Update Cow Health (Game: Anika's Game)",

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:95:49
     }
   };
   // *** RecordGameStats job ***
-  const objectToAxiosParamsRecordGameStatsJob = () => ({
-    url: "/api/jobs/launch/recordgamestats",
-    method: "POST",
-  });
+  const objectToAxiosParamsRecordGameStatsJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit record game stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:95:56
     }
   };
   // *** RecordGameStats job ***
-  const objectToAxiosParamsRecordGameStatsJob = () => ({
-    url: "/api/jobs/launch/recordgamestats",
-    method: "POST",
-  });
+  const objectToAxiosParamsRecordGameStatsJob = () => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit record game stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:108:48
   );
   // Stryker restore all
 
-  const submitRecordGameStatsJob = async () => {
-    toast("Submitted Job: Record Game Stats");
-    RecordGameStatsMutation.mutate();
-  };
+  const submitRecordGameStatsJob = async () => {};
 
   // *** MilkTheCows job ***
killedBy: AdminJobsPage tests user can submit record game stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:120:51
     method: "POST",
   });
 
-  const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({
-    url: `/api/jobs/launch/milkthecowjobsinglegame?gameId=${data.selectedGame}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsMilkTheCowsJobSingle = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:139:48
   );
   // Stryker restore all
 
-  const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedGameName === "All Games") {
-      toast("Submitted Job: Milk The Cows!");
-      MilkTheCowsMutation.mutate();
-    } else {
-      toast(`Submitted Job: Milk The Cows! (Game: ${data.selectedGameName})`);
-      MilkTheCowsSingleMutation.mutate(data);
-    }
-  };
+  const submitMilkTheCowsJob = async (data) => {};
   // *** Instructor Report job ***
 
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/main/pages/AdminJobsPage.jsx:140:9
   // Stryker restore all
 
   const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedGameName === "All Games") {
+    if (data.selectedGameName !== "All Games") {
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: expected '/api/jobs/launch/milkthecowjob' to be '/api/jobs/launch/milkthecowjobsingleg…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:140:48
   // Stryker restore all
 
   const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedGameName === "All Games") {
-      toast("Submitted Job: Milk The Cows!");
-      MilkTheCowsMutation.mutate();
-    } else {
+    if (data.selectedGameName === "All Games") {} else {
       toast(`Submitted Job: Milk The Cows! (Game: ${data.selectedGameName})`);
       MilkTheCowsSingleMutation.mutate(data);
killedBy: AdminJobsPage tests user can submit milk the cows job for all game
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:143:12
     if (data.selectedGameName === "All Games") {
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
-    } else {
-      toast(`Submitted Job: Milk The Cows! (Game: ${data.selectedGameName})`);
-      MilkTheCowsSingleMutation.mutate(data);
-    }
+    } else {}
   };
   // *** Instructor Report job ***
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:170:72
 
   // *** Instructor Report (Specific Game) job ***
 
-  const objectToAxiosParamsInstructorReportSpecificGameJob = (data) => {
-    return {
-      url: `/api/jobs/launch/instructorreportsinglegame?gameId=${data.selectedGame}`,
-      method: "POST",
-    };
-  };
+  const objectToAxiosParamsInstructorReportSpecificGameJob = (data) => {};
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit instructor report (specific game) job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:172:12
 
   const objectToAxiosParamsInstructorReportSpecificGameJob = (data) => {
     return {
-      url: `/api/jobs/launch/instructorreportsinglegame?gameId=${data.selectedGame}`,
+      url: ``,
       method: "POST",
     };
killedBy: AdminJobsPage tests user can submit instructor report (specific game) job
statusReason: expected '' to be '/api/jobs/launch/instructorreportsing…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:185:65
   );
   // Stryker restore all
 
-  const submitInstructorReportSpecificGameJob = async (data) => {
-    toast("Submitted Job: Instructor Report (Specific Game)");
-    InstructorReportSpecificGameMutation.mutate(data);
-  };
+  const submitInstructorReportSpecificGameJob = async (data) => {};
 
   const jobLaunchers = [
killedBy: AdminJobsPage tests user can submit instructor report (specific game) job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:203:5
       name: "Update Cow Health",
       form: <UpdateCowHealthForm submitAction={submitUpdateCowHealthJob} />,
     },
-    {
-      name: "Record Game Stats",
-      form: <RecordGameStatsForm submitAction={submitRecordGameStatsJob} />,
-    },
+    {},
     {
       name: "Milk The Cows",
killedBy: AdminJobsPage tests user can submit record game stats job
statusReason: Unable to find an element with the text: Record Game Stats. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:204:13
       form: <UpdateCowHealthForm submitAction={submitUpdateCowHealthJob} />,
     },
     {
-      name: "Record Game Stats",
+      name: "",
       form: <RecordGameStatsForm submitAction={submitRecordGameStatsJob} />,
     },
killedBy: AdminJobsPage tests user can submit record game stats job
statusReason: Unable to find an element with the text: Record Game Stats. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
