[Killed] StringLiteral
src/main/pages/AdminListGamePageV2.jsx:18:38
   const location = useLocation();
   const navigate = useNavigate();
 
-  const [query, setQuery] = useState("");
+  const [query, setQuery] = useState("Stryker was here!");
 
   const handleQueryChange = (event) => {
killedBy: AdminListGamePageV2 tests renders three game without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminGameCard-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminListGamePageV2.jsx:20:40
 
   const [query, setQuery] = useState("");
 
-  const handleQueryChange = (event) => {
-    setQuery(event.target.value);
-  };
+  const handleQueryChange = (event) => {};
 
   // Stryker disable  all
killedBy: AdminListGamePageV2 tests search bar filters game correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="mb-3 card"
  data-testid="AdminGameCard-1"
  style="border: 1px solid #e0e0e0; box-shadow: 0 2px 4px rgba(0,0,0,0.1); transition: box-shadow 0.2s ease;"
>
  <div

[Killed] ArrowFunction
src/main/pages/AdminListGamePageV2.jsx:37:37
   );
   // Stryker restore  all
 
-  const sortedGame = [...game].sort((a, b) => b.game.id - a.game.id);
+  const sortedGame = [...game].sort(() => undefined);
 
   const filteredGame = sortedGame.filter((c) =>
killedBy: AdminListGamePageV2 tests renders game sorted newest to oldest by id
statusReason: expected [ 'AdminGameCard-1', …(2) ] to deeply equal [ 'AdminGameCard-3', …(2) ]

[Killed] ArithmeticOperator
src/main/pages/AdminListGamePageV2.jsx:37:47
   );
   // Stryker restore  all
 
-  const sortedGame = [...game].sort((a, b) => b.game.id - a.game.id);
+  const sortedGame = [...game].sort((a, b) => b.game.id + a.game.id);
 
   const filteredGame = sortedGame.filter((c) =>
killedBy: AdminListGamePageV2 tests renders game sorted newest to oldest by id
statusReason: expected [ 'AdminGameCard-1', …(2) ] to deeply equal [ 'AdminGameCard-3', …(2) ]

[Killed] ArrowFunction
src/main/pages/AdminListGamePageV2.jsx:39:42
 
   const sortedGame = [...game].sort((a, b) => b.game.id - a.game.id);
 
-  const filteredGame = sortedGame.filter((c) =>
-    c.game.name.toLowerCase().includes(query.toLowerCase()),
+  const filteredGame = sortedGame.filter(() => undefined,
   );
 
killedBy: AdminListGamePageV2 tests renders three game without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminGameCard-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
src/main/pages/AdminListGamePageV2.jsx:39:24
 
   const sortedGame = [...game].sort((a, b) => b.game.id - a.game.id);
 
-  const filteredGame = sortedGame.filter((c) =>
-    c.game.name.toLowerCase().includes(query.toLowerCase()),
-  );
+  const filteredGame = sortedGame;
 
   const focusId = getFocusTargetId(location.search);
killedBy: AdminListGamePageV2 tests search bar filters game correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="mb-3 card"
  data-testid="AdminGameCard-1"
  style="border: 1px solid #e0e0e0; box-shadow: 0 2px 4px rgba(0,0,0,0.1); transition: box-shadow 0.2s ease;"
>
  <div

[Killed] MethodExpression
src/main/pages/AdminListGamePageV2.jsx:40:40
   const sortedGame = [...game].sort((a, b) => b.game.id - a.game.id);
 
   const filteredGame = sortedGame.filter((c) =>
-    c.game.name.toLowerCase().includes(query.toLowerCase()),
+    c.game.name.toLowerCase().includes(query.toUpperCase()),
   );
 
killedBy: AdminListGamePageV2 tests search bar filters game correctly
statusReason: Unable to find an element by: [data-testid="AdminGameCard-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
src/main/pages/AdminListGamePageV2.jsx:40:5
   const sortedGame = [...game].sort((a, b) => b.game.id - a.game.id);
 
   const filteredGame = sortedGame.filter((c) =>
-    c.game.name.toLowerCase().includes(query.toLowerCase()),
+    c.game.name.toUpperCase().includes(query.toLowerCase()),
   );
 
killedBy: AdminListGamePageV2 tests search bar filters game correctly
statusReason: Unable to find an element by: [data-testid="AdminGameCard-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/pages/AdminListGamePageV2.jsx:45:19
 
   const focusId = getFocusTargetId(location.search);
 
-  useEffect(() => {
-    // Wait until the (re)fetch settles so we scroll against the final layout,
-    // then remove ?focus= from the URL so later data updates don't re-scroll.
-    if (!focusId || isFetching || game.length === 0) {
-      return;
-    }
-    scrollToFocusTarget({ targetId: focusId });
-    navigate(location.pathname, { replace: true });
-  }, [focusId, isFetching, game, navigate, location.pathname]);
+  useEffect(() => {}, [focusId, isFetching, game, navigate, location.pathname]);
 
   // Stryker disable all - styles that don't need to be mut tested
killedBy: AdminListGamePageV2 tests scrolls to the focused game and strips the focus param
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/main/pages/AdminListGamePageV2.jsx:48:35
   useEffect(() => {
     // Wait until the (re)fetch settles so we scroll against the final layout,
     // then remove ?focus= from the URL so later data updates don't re-scroll.
-    if (!focusId || isFetching || game.length === 0) {
+    if (!focusId || isFetching || game.length !== 0) {
       return;
     }
killedBy: AdminListGamePageV2 tests scrolls to the focused game and strips the focus param
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/AdminListGamePageV2.jsx:48:35
   useEffect(() => {
     // Wait until the (re)fetch settles so we scroll against the final layout,
     // then remove ?focus= from the URL so later data updates don't re-scroll.
-    if (!focusId || isFetching || game.length === 0) {
+    if (!focusId || isFetching || false) {
       return;
     }
killedBy: AdminListGamePageV2 tests does not scroll or rewrite the URL when there are no game
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "/admin/listgamev2",

[Killed] BooleanLiteral
src/main/pages/AdminListGamePageV2.jsx:52:44
       return;
     }
     scrollToFocusTarget({ targetId: focusId });
-    navigate(location.pathname, { replace: true });
+    navigate(location.pathname, { replace: false });
   }, [focusId, isFetching, game, navigate, location.pathname]);
 
killedBy: AdminListGamePageV2 tests scrolls to the focused game and strips the focus param
statusReason: expected "spy" to be called with arguments: [ '/admin/listgamev2', …(1) ]

Received: 

  1st spy call:

  [
    "/admin/listgamev2",

[Killed] ArrayDeclaration
src/main/pages/AdminListGamePageV2.jsx:53:6
     }
     scrollToFocusTarget({ targetId: focusId });
     navigate(location.pathname, { replace: true });
-  }, [focusId, isFetching, game, navigate, location.pathname]);
+  }, []);
 
   // Stryker disable all - styles that don't need to be mut tested
killedBy: AdminListGamePageV2 tests scrolls to the focused game and strips the focus param
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminListGamePageV2.jsx:86:55
             <Button
               href="/api/gamestats/downloadAll"
               variant="outline-success"
-              style={{ borderRadius: "30px", padding: "10px 20px" }}
+              style={{ borderRadius: "30px", padding: "" }}
             >
               Download All Stats
killedBy: AdminListGamePageV2 tests renders without crashing for regular user
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- padding: 10px 20px;

[Killed] ObjectLiteral
src/main/pages/AdminListGamePageV2.jsx:86:22
             <Button
               href="/api/gamestats/downloadAll"
               variant="outline-success"
-              style={{ borderRadius: "30px", padding: "10px 20px" }}
+              style={{}}
             >
               Download All Stats
killedBy: AdminListGamePageV2 tests renders without crashing for regular user
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- border-radius: 30px;

[Killed] LogicalOperator
src/main/pages/AdminListGamePageV2.jsx:97:12
           className="pt-3"
           style={{ animation: "fadeInDown 1s ease-out" }}
         >
-          {filteredGame &&
-            filteredGame.map((common) => (
-              <div key={common.game.id} id={String(common.game.id)}>
-                <AdminGameCard commonItem={common} currentUser={currentUser} />
-              </div>
-            ))}
+          {filteredGame || filteredGame.map(common => <div key={common.game.id} id={String(common.game.id)}>
+                <AdminGameCard commonItem={common} currentUser={currentUser} />
+              </div>)}
         </Container>
       </div>
killedBy: AdminListGamePageV2 tests renders three game without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminGameCard-1"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/pages/AdminListGamePageV2.jsx:97:12
           className="pt-3"
           style={{ animation: "fadeInDown 1s ease-out" }}
         >
-          {filteredGame &&
-            filteredGame.map((common) => (
-              <div key={common.game.id} id={String(common.game.id)}>
-                <AdminGameCard commonItem={common} currentUser={currentUser} />
-              </div>
-            ))}
+          {true}
         </Container>
       </div>
killedBy: AdminListGamePageV2 tests renders three game without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminGameCard-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminListGamePageV2.jsx:98:30
           style={{ animation: "fadeInDown 1s ease-out" }}
         >
           {filteredGame &&
-            filteredGame.map((common) => (
-              <div key={common.game.id} id={String(common.game.id)}>
-                <AdminGameCard commonItem={common} currentUser={currentUser} />
-              </div>
-            ))}
+            filteredGame.map(() => undefined)}
         </Container>
       </div>
killedBy: AdminListGamePageV2 tests renders three game without crashing for admin user
statusReason: Unable to find an element by: [data-testid="AdminGameCard-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
