[Killed] BlockStatement
main/components/Jobs/RecordGameStatsForm.jsx:7:4
 function RecordGameStatsForm({
   submitAction = () => {},
   testid = "RecordGameStatsForm",
-}) {
-  const { handleSubmit } = useForm(); //wraps form submission to handle the form data
-  return (
-    <Form onSubmit={handleSubmit(submitAction)} data-testid={testid}>
-      <Form.Group className="mb-3">
-        <Form.Text>
-          Record statistics for all games. This will create a GameStats record
-          for each game with current health and profit data.
-        </Form.Text>
-      </Form.Group>
-      <Button type="submit" data-testid="RecordGameStatsForm-Submit-Button">
-        Record Stats
-      </Button>
-    </Form>
-  );
-}
+}) {}
 
 export default RecordGameStatsForm;
killedBy: AdminJobsPage tests user can submit record game stats job
statusReason: Unable to find an element by: [data-testid="RecordGameStatsForm-Submit-Button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
