[Killed] StringLiteral
src/main/pages/InstructorAdminShowPage.jsx:30:15
         <h1 data-testid="InstructorAdminShowPage-title">
           {course
             ? `${course.code} - ${course.name} (${course.term})`
-            : "Course"}
+            : ""}
         </h1>
         <Tabs defaultActiveKey="students" className="mb-3">
killedBy: InstructorAdminShowPage tests renders a default title while the course is loading
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Course
Received:
