[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:23:28
   criterion1Weight: 40,
   criterion2Weight: 40,
   criterion2MinDays: 5,
-  criterion2PartialCredit: false,
+  criterion2PartialCredit: true,
   criterion3Weight: 20,
   totalPoints: 100,
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  class="form-check-input"
  data-testid="ParticipationGradeTabComponent-criterion2PartialCredit"
  id="criterion2PartialCredit"
  name="criterion2PartialCredit"

[Killed] BlockStatement
main/components/Courses/ParticipationGradeTabComponent.jsx:33:43
 // startDate/endDate needs no explicit guard: it makes one of the Date
 // objects below Invalid, which propagates to a NaN diffDays and so already
 // falls through to the null branch of the final ternary.
-function daysInPeriod(startDate, endDate) {
-  const start = new Date(`${startDate}T00:00:00`);
-  const end = new Date(`${endDate}T00:00:00`);
-  const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
-  return diffDays >= 0 ? diffDays + 1 : null;
-}
+function daysInPeriod(startDate, endDate) {}
 
 const columns = [
killedBy: ParticipationGradeTabComponent tests does not show the days-in-period hint or the download button before a date range is chosen
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  data-testid="ParticipationGradeTabComponent-daysInPeriod"
>
   day(s) in the selected period.
</p> instead

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:36:48
 function daysInPeriod(startDate, endDate) {
   const start = new Date(`${startDate}T00:00:00`);
   const end = new Date(`${endDate}T00:00:00`);
-  const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
+  const diffDays = Math.round((end - start) / (1000 / 60 * 60 * 24));
   return diffDays >= 0 ? diffDays + 1 : null;
 }
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10 day(s) in the selected period.
Received:
  32401 day(s) in the selected period.

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:36:32
 function daysInPeriod(startDate, endDate) {
   const start = new Date(`${startDate}T00:00:00`);
   const end = new Date(`${endDate}T00:00:00`);
-  const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
+  const diffDays = Math.round((end + start) / (1000 * 60 * 60 * 24));
   return diffDays >= 0 ? diffDays + 1 : null;
 }
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-daysInPeriod"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:37:10
   const start = new Date(`${startDate}T00:00:00`);
   const end = new Date(`${endDate}T00:00:00`);
   const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
-  return diffDays >= 0 ? diffDays + 1 : null;
+  return false ? diffDays + 1 : null;
 }
 
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-daysInPeriod"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:37:10
   const start = new Date(`${startDate}T00:00:00`);
   const end = new Date(`${endDate}T00:00:00`);
   const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
-  return diffDays >= 0 ? diffDays + 1 : null;
+  return true ? diffDays + 1 : null;
 }
 
killedBy: ParticipationGradeTabComponent tests does not show the days-in-period hint or the download button before a date range is chosen
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  data-testid="ParticipationGradeTabComponent-daysInPeriod"
>
  NaN
   day(s) in the selected period.
</p> instead

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:44:3
   { Header: "Perm", accessor: "perm" },
   { Header: "Last Name", accessor: "lastName" },
   { Header: "First/Middle Name", accessor: "firstMiddleName" },
-  {
-    Header: "Interacted",
-    accessor: "interactedAtLeastOnce",
-    Cell: ({ value }) => (value ? "Yes" : "No"),
-  },
+  {},
   { Header: "Days Interacted", accessor: "daysInteracted" },
   {
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:46:15
   { Header: "First/Middle Name", accessor: "firstMiddleName" },
   {
     Header: "Interacted",
-    accessor: "interactedAtLeastOnce",
+    accessor: "",
     Cell: ({ value }) => (value ? "Yes" : "No"),
   },
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-interactedAtLeastOnce"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ArrowFunction
main/components/Courses/ParticipationGradeTabComponent.jsx:47:11
   {
     Header: "Interacted",
     accessor: "interactedAtLeastOnce",
-    Cell: ({ value }) => (value ? "Yes" : "No"),
+    Cell: () => undefined,
   },
   { Header: "Days Interacted", accessor: "daysInteracted" },
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:47:35
   {
     Header: "Interacted",
     accessor: "interactedAtLeastOnce",
-    Cell: ({ value }) => (value ? "Yes" : "No"),
+    Cell: ({ value }) => (value ? "" : "No"),
   },
   { Header: "Days Interacted", accessor: "daysInteracted" },
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:49:42
     accessor: "interactedAtLeastOnce",
     Cell: ({ value }) => (value ? "Yes" : "No"),
   },
-  { Header: "Days Interacted", accessor: "daysInteracted" },
+  { Header: "Days Interacted", accessor: "" },
   {
     Header: "Owned & Checked In On a Cow",
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-daysInteracted"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:49:3
     accessor: "interactedAtLeastOnce",
     Cell: ({ value }) => (value ? "Yes" : "No"),
   },
-  { Header: "Days Interacted", accessor: "daysInteracted" },
+  {},
   {
     Header: "Owned & Checked In On a Cow",
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:50:3
     Cell: ({ value }) => (value ? "Yes" : "No"),
   },
   { Header: "Days Interacted", accessor: "daysInteracted" },
-  {
-    Header: "Owned & Checked In On a Cow",
-    accessor: "ownedAndCheckedInOnACow",
-    Cell: ({ value }) => (value ? "Yes" : "No"),
-  },
+  {},
   { Header: "Points Earned", accessor: "totalPointsEarned" },
 ];
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Timeout] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:51:13
   },
   { Header: "Days Interacted", accessor: "daysInteracted" },
   {
-    Header: "Owned & Checked In On a Cow",
+    Header: "",
     accessor: "ownedAndCheckedInOnACow",
     Cell: ({ value }) => (value ? "Yes" : "No"),

[Killed] ArrowFunction
main/components/Courses/ParticipationGradeTabComponent.jsx:53:11
   {
     Header: "Owned & Checked In On a Cow",
     accessor: "ownedAndCheckedInOnACow",
-    Cell: ({ value }) => (value ? "Yes" : "No"),
+    Cell: () => undefined,
   },
   { Header: "Points Earned", accessor: "totalPointsEarned" },
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:53:35
   {
     Header: "Owned & Checked In On a Cow",
     accessor: "ownedAndCheckedInOnACow",
-    Cell: ({ value }) => (value ? "Yes" : "No"),
+    Cell: ({ value }) => (value ? "" : "No"),
   },
   { Header: "Points Earned", accessor: "totalPointsEarned" },
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Survived] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:55:13
     accessor: "ownedAndCheckedInOnACow",
     Cell: ({ value }) => (value ? "Yes" : "No"),
   },
-  { Header: "Points Earned", accessor: "totalPointsEarned" },
+  { Header: "", accessor: "totalPointsEarned" },
 ];
 

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:62:12
 // and downloading them as a CSV, scoped to this courseId. See issue #292.
 export default function ParticipationGradeTabComponent({
   courseId,
-  testid = "ParticipationGradeTabComponent",
+  testid = "",
 }) {
   const {
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-criterion1Weight"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:75:34
   const [grades, setGrades] = useState(null);
   const [downloadParams, setDownloadParams] = useState(null);
 
-  const criterion1Weight = watch("criterion1Weight");
+  const criterion1Weight = watch("");
   const criterion2Weight = watch("criterion2Weight");
   const criterion3Weight = watch("criterion3Weight");
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  60%

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:76:34
   const [downloadParams, setDownloadParams] = useState(null);
 
   const criterion1Weight = watch("criterion1Weight");
-  const criterion2Weight = watch("criterion2Weight");
+  const criterion2Weight = watch("");
   const criterion3Weight = watch("criterion3Weight");
   const totalWeight =
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  60%

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:77:34
 
   const criterion1Weight = watch("criterion1Weight");
   const criterion2Weight = watch("criterion2Weight");
-  const criterion3Weight = watch("criterion3Weight");
+  const criterion3Weight = watch("");
   const totalWeight =
     Number(criterion1Weight || 0) +
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  80%

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:79:5
   const criterion2Weight = watch("criterion2Weight");
   const criterion3Weight = watch("criterion3Weight");
   const totalWeight =
-    Number(criterion1Weight || 0) +
-    Number(criterion2Weight || 0) +
-    Number(criterion3Weight || 0);
+    Number(criterion1Weight || 0) + Number(criterion2Weight || 0) - Number(criterion3Weight || 0);
 
   // No explicit method: axios defaults to GET, and this keeps the source
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  60%

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:79:12
   const criterion2Weight = watch("criterion2Weight");
   const criterion3Weight = watch("criterion3Weight");
   const totalWeight =
-    Number(criterion1Weight || 0) +
+    Number(true) +
     Number(criterion2Weight || 0) +
     Number(criterion3Weight || 0);
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  61%

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:80:12
   const criterion3Weight = watch("criterion3Weight");
   const totalWeight =
     Number(criterion1Weight || 0) +
-    Number(criterion2Weight || 0) +
+    Number(false) +
     Number(criterion3Weight || 0);
 
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  60%

[Killed] LogicalOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:80:12
   const criterion3Weight = watch("criterion3Weight");
   const totalWeight =
     Number(criterion1Weight || 0) +
-    Number(criterion2Weight || 0) +
+    Number(criterion2Weight && 0) +
     Number(criterion3Weight || 0);
 
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  60%

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:81:12
   const totalWeight =
     Number(criterion1Weight || 0) +
     Number(criterion2Weight || 0) +
-    Number(criterion3Weight || 0);
+    Number(true);
 
   // No explicit method: axios defaults to GET, and this keeps the source
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  81%

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:81:12
   const totalWeight =
     Number(criterion1Weight || 0) +
     Number(criterion2Weight || 0) +
-    Number(criterion3Weight || 0);
+    Number(false);
 
   // No explicit method: axios defaults to GET, and this keeps the source
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  80%

[Killed] ArrowFunction
main/components/Courses/ParticipationGradeTabComponent.jsx:87:38
   // free of a "GET" string literal whose value axios ignores anyway (it
   // falls back to GET for any falsy method), which would otherwise be an
   // unkillable mutation-testing survivor.
-  const objectToAxiosParamsCompute = (data) => ({
-    url: "/api/participationgrade/compute",
-    params: { courseId, ...data },
-  });
+  const objectToAxiosParamsCompute = () => undefined;
 
   const computeMutation = useBackendMutation(objectToAxiosParamsCompute, {
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: Cannot read properties of undefined (reading 'totalPoints')

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:88:10
   // falls back to GET for any falsy method), which would otherwise be an
   // unkillable mutation-testing survivor.
   const objectToAxiosParamsCompute = (data) => ({
-    url: "/api/participationgrade/compute",
+    url: "",
     params: { courseId, ...data },
   });
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expected '' to be '/api/participationgrade/compute' // Object.is equality

[Killed] BlockStatement
main/components/Courses/ParticipationGradeTabComponent.jsx:93:26
   });
 
   const computeMutation = useBackendMutation(objectToAxiosParamsCompute, {
-    onSuccess: (data) => {
-      setGrades(data);
-      toast(`Computed grades for ${data.length} student(s).`);
-    },
+    onSuccess: (data) => {},
   });
 
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:95:13
   const computeMutation = useBackendMutation(objectToAxiosParamsCompute, {
     onSuccess: (data) => {
       setGrades(data);
-      toast(`Computed grades for ${data.length} student(s).`);
+      toast(``);
     },
   });
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expected "spy" to be called with arguments: [ 'Computed grades for 2 student(s).' ]

Received: 

  1st spy call:

  [
-   "Computed grades for 2 student(s).",

[Killed] BlockStatement
main/components/Courses/ParticipationGradeTabComponent.jsx:99:30
     },
   });
 
-  const onSubmit = (data) => {
-    setDownloadParams(data);
-    computeMutation.mutate(data);
-  };
+  const onSubmit = (data) => {};
 
   const downloadUrl = downloadParams
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:105:63
   };
 
   const downloadUrl = downloadParams
-    ? `/api/participationgrade/download?${new URLSearchParams({ courseId, ...downloadParams }).toString()}`
+    ? `/api/participationgrade/download?${new URLSearchParams({}).toString()}`
     : null;
 
killedBy: ParticipationGradeTabComponent tests shows a Download CSV button with a matching query string only after a successful preview
statusReason: expected '/api/participationgrade/download?' to contain 'courseId=1'

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:105:7
   };
 
   const downloadUrl = downloadParams
-    ? `/api/participationgrade/download?${new URLSearchParams({ courseId, ...downloadParams }).toString()}`
+    ? ``
     : null;
 
killedBy: ParticipationGradeTabComponent tests shows a Download CSV button with a matching query string only after a successful preview
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-download-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:108:27
     ? `/api/participationgrade/download?${new URLSearchParams({ courseId, ...downloadParams }).toString()}`
     : null;
 
-  const startDate = watch("startDate");
+  const startDate = watch("");
   const endDate = watch("endDate");
   const period = daysInPeriod(startDate, endDate);
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-daysInPeriod"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:123:28
                 id="startDate"
                 type="date"
                 data-testid={`${testid}-startDate`}
-                isInvalid={!!errors.startDate}
+                isInvalid={!errors.startDate}
                 {...register("startDate", {
                   required: "Start date is required",
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:124:43
                 type="date"
                 data-testid={`${testid}-startDate`}
                 isInvalid={!!errors.startDate}
-                {...register("startDate", {
-                  required: "Start date is required",
-                })}
+                {...register("startDate", {})}
               />
               <Form.Control.Feedback type="invalid">
killedBy: ParticipationGradeTabComponent tests shows an error when start date is left empty
statusReason: Unable to find an element with the text: Start date is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:125:29
                 data-testid={`${testid}-startDate`}
                 isInvalid={!!errors.startDate}
                 {...register("startDate", {
-                  required: "Start date is required",
+                  required: "",
                 })}
               />
killedBy: ParticipationGradeTabComponent tests shows an error when start date is left empty
statusReason: Unable to find an element with the text: Start date is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:139:30
               <Form.Control
                 id="endDate"
                 type="date"
-                data-testid={`${testid}-endDate`}
+                data-testid={``}
                 isInvalid={!!errors.endDate}
                 {...register("endDate", {
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-endDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:140:28
                 id="endDate"
                 type="date"
                 data-testid={`${testid}-endDate`}
-                isInvalid={!!errors.endDate}
+                isInvalid={!errors.endDate}
                 {...register("endDate", {
                   required: "End date is required",
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:141:30
                 type="date"
                 data-testid={`${testid}-endDate`}
                 isInvalid={!!errors.endDate}
-                {...register("endDate", {
+                {...register("", {
                   required: "End date is required",
                   validate: {
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
main/components/Courses/ParticipationGradeTabComponent.jsx:144:39
                 {...register("endDate", {
                   required: "End date is required",
                   validate: {
-                    isAfterStartDate: (v) =>
-                      v >= getValues("startDate") ||
-                      "End date must not be before start date",
+                    isAfterStartDate: () => undefined,
                   },
                 })}
killedBy: ParticipationGradeTabComponent tests rejects submission when the end date is before the start date
statusReason: Unable to find an element with the text: End date must not be before start date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:145:23
                   required: "End date is required",
                   validate: {
                     isAfterStartDate: (v) =>
-                      v >= getValues("startDate") ||
-                      "End date must not be before start date",
+                      false,
                   },
                 })}
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:145:23
                   required: "End date is required",
                   validate: {
                     isAfterStartDate: (v) =>
-                      v >= getValues("startDate") ||
+                      false ||
                       "End date must not be before start date",
                   },
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:165:28
                 type="number"
                 step="0.01"
                 data-testid={`${testid}-totalPoints`}
-                isInvalid={!!errors.totalPoints}
+                isInvalid={!errors.totalPoints}
                 {...register("totalPoints", {
                   valueAsNumber: true,
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid
