[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:166:45
                 step="0.01"
                 data-testid={`${testid}-totalPoints`}
                 isInvalid={!!errors.totalPoints}
-                {...register("totalPoints", {
-                  valueAsNumber: true,
-                  required: "Total points is required",
-                  min: { value: 0.01, message: "Total points must be > 0" },
-                })}
+                {...register("totalPoints", {})}
               />
               <Form.Control.Feedback type="invalid">
killedBy: ParticipationGradeTabComponent tests shows an error when totalPoints is left empty
statusReason: Unable to find an element with the text: Total points is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:166:30
                 step="0.01"
                 data-testid={`${testid}-totalPoints`}
                 isInvalid={!!errors.totalPoints}
-                {...register("totalPoints", {
+                {...register("", {
                   valueAsNumber: true,
                   required: "Total points is required",
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:167:34
                 data-testid={`${testid}-totalPoints`}
                 isInvalid={!!errors.totalPoints}
                 {...register("totalPoints", {
-                  valueAsNumber: true,
+                  valueAsNumber: false,
                   required: "Total points is required",
                   min: { value: 0.01, message: "Total points must be > 0" },
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected '50' to be 50 // Object.is equality

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:168:29
                 isInvalid={!!errors.totalPoints}
                 {...register("totalPoints", {
                   valueAsNumber: true,
-                  required: "Total points is required",
+                  required: "",
                   min: { value: 0.01, message: "Total points must be > 0" },
                 })}
killedBy: ParticipationGradeTabComponent tests shows an error when totalPoints is left empty
statusReason: Unable to find an element with the text: Total points is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] OptionalChaining
main/components/Courses/ParticipationGradeTabComponent.jsx:173:18
                 })}
               />
               <Form.Control.Feedback type="invalid">
-                {errors.totalPoints?.message}
+                {errors.totalPoints.message}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:201:30
                   type="number"
                   aria-label="Interacted at least once (% weight)"
                   data-testid={`${testid}-criterion1Weight`}
-                  isInvalid={!!errors.criterion1Weight}
+                  isInvalid={!errors.criterion1Weight}
                   {...register("criterion1Weight", {
                     valueAsNumber: true,
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:203:36
                   data-testid={`${testid}-criterion1Weight`}
                   isInvalid={!!errors.criterion1Weight}
                   {...register("criterion1Weight", {
-                    valueAsNumber: true,
+                    valueAsNumber: false,
                     required: true,
                     min: { value: 0, message: "Weight must be 0-100" },
killedBy: ParticipationGradeTabComponent tests treats criterion1Weight and criterion3Weight of 0 as valid inputs to the sum check
statusReason: expected { courseId: 1, …(8) } to match object { criterion1Weight: +0, …(2) }
(6 matching properties omitted from actual)

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:204:31
                   isInvalid={!!errors.criterion1Weight}
                   {...register("criterion1Weight", {
                     valueAsNumber: true,
-                    required: true,
+                    required: false,
                     min: { value: 0, message: "Weight must be 0-100" },
                     max: { value: 100, message: "Weight must be 0-100" },
killedBy: ParticipationGradeTabComponent tests shows a required error when criterion1Weight is cleared
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

Ignored nodes: comments, script, style

[Killed] OptionalChaining
main/components/Courses/ParticipationGradeTabComponent.jsx:210:20
                   })}
                 />
                 <Form.Control.Feedback type="invalid">
-                  {errors.criterion1Weight?.message}
+                  {errors.criterion1Weight.message}
                 </Form.Control.Feedback>
               </td>
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:222:32
                   id="criterion3Weight"
                   type="number"
                   aria-label="Owned & checked in on a living cow (% weight)"
-                  data-testid={`${testid}-criterion3Weight`}
+                  data-testid={``}
                   isInvalid={!!errors.criterion3Weight}
                   {...register("criterion3Weight", {
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-criterion3Weight"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:223:30
                   type="number"
                   aria-label="Owned & checked in on a living cow (% weight)"
                   data-testid={`${testid}-criterion3Weight`}
-                  isInvalid={!!errors.criterion3Weight}
+                  isInvalid={!errors.criterion3Weight}
                   {...register("criterion3Weight", {
                     valueAsNumber: true,
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:225:36
                   data-testid={`${testid}-criterion3Weight`}
                   isInvalid={!!errors.criterion3Weight}
                   {...register("criterion3Weight", {
-                    valueAsNumber: true,
+                    valueAsNumber: false,
                     required: true,
                     min: { value: 0, message: "Weight must be 0-100" },
killedBy: ParticipationGradeTabComponent tests treats criterion1Weight and criterion3Weight of 0 as valid inputs to the sum check
statusReason: expected { courseId: 1, …(8) } to match object { criterion1Weight: +0, …(2) }
(6 matching properties omitted from actual)

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:228:49
                     valueAsNumber: true,
                     required: true,
                     min: { value: 0, message: "Weight must be 0-100" },
-                    max: { value: 100, message: "Weight must be 0-100" },
+                    max: { value: 100, message: "" },
                     validate: {
                       sumsTo100: (v) => {
killedBy: ParticipationGradeTabComponent tests shows 'Weight must be 0-100' when criterion3Weight is set to 150
statusReason: Unable to find an element with the text: Weight must be 0-100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] BlockStatement
main/components/Courses/ParticipationGradeTabComponent.jsx:230:41
                     min: { value: 0, message: "Weight must be 0-100" },
                     max: { value: 100, message: "Weight must be 0-100" },
                     validate: {
-                      sumsTo100: (v) => {
-                        const sum =
-                          Number(getValues("criterion1Weight") || 0) +
-                          Number(getValues("criterion2Weight") || 0) +
-                          Number(v || 0);
-                        return (
-                          sum === 100 ||
-                          "The three weights must sum to 100 (currently " +
-                            sum +
-                            ")"
-                        );
-                      },
+                      sumsTo100: (v) => {},
                     },
                   })}
killedBy: ParticipationGradeTabComponent tests rejects submission when weights do not sum to 100
statusReason: Unable to find an element with the text: The three weights must sum to 100 (currently 110). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:232:27
                     validate: {
                       sumsTo100: (v) => {
                         const sum =
-                          Number(getValues("criterion1Weight") || 0) +
-                          Number(getValues("criterion2Weight") || 0) +
+                          Number(getValues("criterion1Weight") || 0) - Number(getValues("criterion2Weight") || 0) +
                           Number(v || 0);
                         return (
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:232:27
                     validate: {
                       sumsTo100: (v) => {
                         const sum =
-                          Number(getValues("criterion1Weight") || 0) +
-                          Number(getValues("criterion2Weight") || 0) +
-                          Number(v || 0);
+                          Number(getValues("criterion1Weight") || 0) + Number(getValues("criterion2Weight") || 0) - Number(v || 0);
                         return (
                           sum === 100 ||
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:233:34
                       sumsTo100: (v) => {
                         const sum =
                           Number(getValues("criterion1Weight") || 0) +
-                          Number(getValues("criterion2Weight") || 0) +
+                          Number(false) +
                           Number(v || 0);
                         return (
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:233:34
                       sumsTo100: (v) => {
                         const sum =
                           Number(getValues("criterion1Weight") || 0) +
-                          Number(getValues("criterion2Weight") || 0) +
+                          Number(true) +
                           Number(v || 0);
                         return (
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:234:34
                         const sum =
                           Number(getValues("criterion1Weight") || 0) +
                           Number(getValues("criterion2Weight") || 0) +
-                          Number(v || 0);
+                          Number(true);
                         return (
                           sum === 100 ||
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:234:34
                         const sum =
                           Number(getValues("criterion1Weight") || 0) +
                           Number(getValues("criterion2Weight") || 0) +
-                          Number(v || 0);
+                          Number(false);
                         return (
                           sum === 100 ||
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:236:27
                           Number(getValues("criterion2Weight") || 0) +
                           Number(v || 0);
                         return (
-                          sum === 100 ||
-                          "The three weights must sum to 100 (currently " +
-                            sum +
-                            ")"
+                          sum === 100 && "The three weights must sum to 100 (currently " + sum + ")"
                         );
                       },
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:236:27
                           Number(getValues("criterion2Weight") || 0) +
                           Number(v || 0);
                         return (
-                          sum === 100 ||
-                          "The three weights must sum to 100 (currently " +
-                            sum +
-                            ")"
+                          true
                         );
                       },
killedBy: ParticipationGradeTabComponent tests rejects submission when weights do not sum to 100
statusReason: Unable to find an element with the text: The three weights must sum to 100 (currently 110). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] OptionalChaining
main/components/Courses/ParticipationGradeTabComponent.jsx:246:20
                   })}
                 />
                 <Form.Control.Feedback type="invalid">
-                  {errors.criterion3Weight?.message}
+                  {errors.criterion3Weight.message}
                 </Form.Control.Feedback>
               </td>
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:259:30
                   type="number"
                   aria-label="Interacted on at least n days (% weight)"
                   data-testid={`${testid}-criterion2Weight`}
-                  isInvalid={!!errors.criterion2Weight}
+                  isInvalid={!errors.criterion2Weight}
                   {...register("criterion2Weight", {
                     valueAsNumber: true,
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:260:32
                   aria-label="Interacted on at least n days (% weight)"
                   data-testid={`${testid}-criterion2Weight`}
                   isInvalid={!!errors.criterion2Weight}
-                  {...register("criterion2Weight", {
+                  {...register("", {
                     valueAsNumber: true,
                     required: true,
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:260:52
                   aria-label="Interacted on at least n days (% weight)"
                   data-testid={`${testid}-criterion2Weight`}
                   isInvalid={!!errors.criterion2Weight}
-                  {...register("criterion2Weight", {
-                    valueAsNumber: true,
-                    required: true,
-                    min: { value: 0, message: "Weight must be 0-100" },
-                    max: { value: 100, message: "Weight must be 0-100" },
-                  })}
+                  {...register("criterion2Weight", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: ParticipationGradeTabComponent tests shows 'Weight must be 0-100' when criterion2Weight is set to -10
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:261:36
                   data-testid={`${testid}-criterion2Weight`}
                   isInvalid={!!errors.criterion2Weight}
                   {...register("criterion2Weight", {
-                    valueAsNumber: true,
+                    valueAsNumber: false,
                     required: true,
                     min: { value: 0, message: "Weight must be 0-100" },
killedBy: ParticipationGradeTabComponent tests treats criterion1Weight and criterion3Weight of 0 as valid inputs to the sum check
statusReason: expected { courseId: 1, …(8) } to match object { criterion1Weight: +0, …(2) }
(6 matching properties omitted from actual)

[Killed] OptionalChaining
main/components/Courses/ParticipationGradeTabComponent.jsx:268:20
                   })}
                 />
                 <Form.Control.Feedback type="invalid">
-                  {errors.criterion2Weight?.message}
+                  {errors.criterion2Weight.message}
                 </Form.Control.Feedback>
               </td>
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:282:32
                     type="number"
                     className="d-inline-block w-auto"
                     data-testid={`${testid}-criterion2MinDays`}
-                    isInvalid={!!errors.criterion2MinDays}
+                    isInvalid={!errors.criterion2MinDays}
                     {...register("criterion2MinDays", {
                       valueAsNumber: true,
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  d-inline-block w-auto form-control is-invalid

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:283:55
                     className="d-inline-block w-auto"
                     data-testid={`${testid}-criterion2MinDays`}
                     isInvalid={!!errors.criterion2MinDays}
-                    {...register("criterion2MinDays", {
-                      valueAsNumber: true,
-                      required: true,
-                      validate: {
-                        inRange: (v) => {
-                          if (Number(getValues("criterion2Weight")) === 0) {
-                            return true;
-                          }
-                          const max = daysInPeriod(
-                            getValues("startDate"),
-                            getValues("endDate"),
-                          );
-                          if (max === null) {
-                            return true;
-                          }
-                          return (
-                            (v >= 1 && v <= max) ||
-                            `n must be between 1 and ${max} (the number of days in the period)`
-                          );
-                        },
-                      },
-                    })}
+                    {...register("criterion2MinDays", {})}
                   />
                   <Form.Control.Feedback type="invalid">
killedBy: ParticipationGradeTabComponent tests rejects a criterion2MinDays outside the period, when criterion 2 is enabled
statusReason: Unable to find an element with the text: n must be between 1 and 5 (the number of days in the period). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:284:38
                     data-testid={`${testid}-criterion2MinDays`}
                     isInvalid={!!errors.criterion2MinDays}
                     {...register("criterion2MinDays", {
-                      valueAsNumber: true,
+                      valueAsNumber: false,
                       required: true,
                       validate: {
killedBy: ParticipationGradeTabComponent tests submitting a changed criterion2MinDays sends it as a number, not a string
statusReason: expected '3' to be 3 // Object.is equality

[Killed] BlockStatement
main/components/Courses/ParticipationGradeTabComponent.jsx:287:41
                       valueAsNumber: true,
                       required: true,
                       validate: {
-                        inRange: (v) => {
-                          if (Number(getValues("criterion2Weight")) === 0) {
-                            return true;
-                          }
-                          const max = daysInPeriod(
-                            getValues("startDate"),
-                            getValues("endDate"),
-                          );
-                          if (max === null) {
-                            return true;
-                          }
-                          return (
-                            (v >= 1 && v <= max) ||
-                            `n must be between 1 and ${max} (the number of days in the period)`
-                          );
-                        },
+                        inRange: (v) => {},
                       },
                     })}
killedBy: ParticipationGradeTabComponent tests rejects a criterion2MinDays outside the period, when criterion 2 is enabled
statusReason: Unable to find an element with the text: n must be between 1 and 5 (the number of days in the period). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:288:31
                       required: true,
                       validate: {
                         inRange: (v) => {
-                          if (Number(getValues("criterion2Weight")) === 0) {
+                          if (false) {
                             return true;
                           }
killedBy: ParticipationGradeTabComponent tests accepts an end date equal to the start date (a one-day period)
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:288:31
                       required: true,
                       validate: {
                         inRange: (v) => {
-                          if (Number(getValues("criterion2Weight")) === 0) {
+                          if (Number(getValues("criterion2Weight")) !== 0) {
                             return true;
                           }
killedBy: ParticipationGradeTabComponent tests accepts an end date equal to the start date (a one-day period)
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:289:36
                       validate: {
                         inRange: (v) => {
                           if (Number(getValues("criterion2Weight")) === 0) {
-                            return true;
+                            return false;
                           }
                           const max = daysInPeriod(
killedBy: ParticipationGradeTabComponent tests accepts an end date equal to the start date (a one-day period)
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/Courses/ParticipationGradeTabComponent.jsx:295:45
                             getValues("startDate"),
                             getValues("endDate"),
                           );
-                          if (max === null) {
-                            return true;
-                          }
+                          if (max === null) {}
                           return (
                             (v >= 1 && v <= max) ||
killedBy: ParticipationGradeTabComponent tests does not flag criterion2MinDays as invalid when criterion 2 is enabled but no date range is set yet
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  d-inline-block w-auto form-control is-invalid

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:295:31
                             getValues("startDate"),
                             getValues("endDate"),
                           );
-                          if (max === null) {
+                          if (false) {
                             return true;
                           }
killedBy: ParticipationGradeTabComponent tests does not flag criterion2MinDays as invalid when criterion 2 is enabled but no date range is set yet
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  d-inline-block w-auto form-control is-invalid
