[Killed] BooleanLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:296:36
                             getValues("endDate"),
                           );
                           if (max === null) {
-                            return true;
+                            return false;
                           }
                           return (
killedBy: ParticipationGradeTabComponent tests does not flag criterion2MinDays as invalid when criterion 2 is enabled but no date range is set yet
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  d-inline-block w-auto form-control is-invalid

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:299:29
                             return true;
                           }
                           return (
-                            (v >= 1 && v <= max) ||
-                            `n must be between 1 and ${max} (the number of days in the period)`
+                            false
                           );
                         },
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:299:40
                             return true;
                           }
                           return (
-                            (v >= 1 && v <= max) ||
+                            (v >= 1 && true) ||
                             `n must be between 1 and ${max} (the number of days in the period)`
                           );
killedBy: ParticipationGradeTabComponent tests rejects a criterion2MinDays outside the period, when criterion 2 is enabled
statusReason: Unable to find an element with the text: n must be between 1 and 5 (the number of days in the period). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] OptionalChaining
main/components/Courses/ParticipationGradeTabComponent.jsx:307:22
                     })}
                   />
                   <Form.Control.Feedback type="invalid">
-                    {errors.criterion2MinDays?.message}
+                    {errors.criterion2MinDays.message}
                   </Form.Control.Feedback>
                 </div>
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:330:36
                       type="switch"
                       id="criterion2PartialCredit"
                       className="d-inline-block"
-                      data-testid={`${testid}-criterion2PartialCredit`}
+                      data-testid={``}
                       {...register("criterion2PartialCredit")}
                     />
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-criterion2PartialCredit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:331:36
                       id="criterion2PartialCredit"
                       className="d-inline-block"
                       data-testid={`${testid}-criterion2PartialCredit`}
-                      {...register("criterion2PartialCredit")}
+                      {...register("")}
                     />
                   </OverlayTrigger>
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:338:32
               </td>
             </tr>
             <tr>
-              <td data-testid={`${testid}-totalWeight`}>{totalWeight}%</td>
+              <td data-testid={``}>{totalWeight}%</td>
               <td>Total Percentage (should be 100%)</td>
               <td></td>
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-totalWeight"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] EqualityOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:345:10
           </tbody>
         </Table>
 
-        {period !== null && (
+        {period === null && (
           <p data-testid={`${testid}-daysInPeriod`}>
             {period} day(s) in the selected period.
killedBy: ParticipationGradeTabComponent tests does not show the days-in-period hint or the download button before a date range is chosen
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  data-testid="ParticipationGradeTabComponent-daysInPeriod"
>
   day(s) in the selected period.
</p> instead

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:345:10
           </tbody>
         </Table>
 
-        {period !== null && (
-          <p data-testid={`${testid}-daysInPeriod`}>
-            {period} day(s) in the selected period.
-          </p>
-        )}
+        {false}
 
         <Button
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-daysInPeriod"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:360:10
         >
           Preview Grades
         </Button>
-        {downloadUrl && (
-          <Button
-            href={downloadUrl}
-            variant="success"
-            className="mb-3"
-            data-testid={`${testid}-download-button`}
-          >
-            Download CSV
-          </Button>
-        )}
+        {true}
       </Form>
 
killedBy: ParticipationGradeTabComponent tests shows a Download CSV button with a matching query string only after a successful preview
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-download-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:360:10
         >
           Preview Grades
         </Button>
-        {downloadUrl && (
-          <Button
-            href={downloadUrl}
-            variant="success"
-            className="mb-3"
-            data-testid={`${testid}-download-button`}
-          >
-            Download CSV
-          </Button>
-        )}
+        {false}
       </Form>
 
killedBy: ParticipationGradeTabComponent tests shows a Download CSV button with a matching query string only after a successful preview
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-download-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] LogicalOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:372:8
         )}
       </Form>
 
-      {grades && (
-        <OurTable data={grades} columns={columns} testid={`${testid}-table`} />
-      )}
+      {grades || <OurTable data={grades} columns={columns} testid={`${testid}-table`} />}
     </div>
   );
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Cannot read properties of null (reading 'forEach')

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:372:8
         )}
       </Form>
 
-      {grades && (
-        <OurTable data={grades} columns={columns} testid={`${testid}-table`} />
-      )}
+      {false}
     </div>
   );
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:373:59
       </Form>
 
       {grades && (
-        <OurTable data={grades} columns={columns} testid={`${testid}-table`} />
+        <OurTable data={grades} columns={columns} testid={``} />
       )}
     </div>
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >
