[Timeout] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:25:12
 
 const DEFAULT_VALUES = {
   startDate: "",
-  endDate: "",
+  endDate: "Stryker was here!",
   criterion1Weight: 40,
   criterion2Weight: 40,

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:40:26
 // objects below Invalid, which propagates to a NaN diffDays and so already
 // falls through to the null branch of the final ternary.
 function daysInPeriod(startDate, endDate) {
-  const start = new Date(`${startDate}T00:00:00`);
+  const start = new Date(``);
   const end = new Date(`${endDate}T00:00:00`);
   const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-daysInPeriod"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:42:48
 function daysInPeriod(startDate, endDate) {
   const start = new Date(`${startDate}T00:00:00`);
   const end = new Date(`${endDate}T00:00:00`);
-  const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
+  const diffDays = Math.round((end - start) / (1000 * 60 * 60 / 24));
   return diffDays >= 0 ? diffDays + 1 : null;
 }
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10 day(s) in the selected period.
Received:
  5185 day(s) in the selected period.

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:42:48
 function daysInPeriod(startDate, endDate) {
   const start = new Date(`${startDate}T00:00:00`);
   const end = new Date(`${endDate}T00:00:00`);
-  const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
+  const diffDays = Math.round((end - start) / (1000 * 60 / 60 * 24));
   return diffDays >= 0 ? diffDays + 1 : null;
 }
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10 day(s) in the selected period.
Received:
  32401 day(s) in the selected period.

[Killed] ArithmeticOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:43:26
   const start = new Date(`${startDate}T00:00:00`);
   const end = new Date(`${endDate}T00:00:00`);
   const diffDays = Math.round((end - start) / (1000 * 60 * 60 * 24));
-  return diffDays >= 0 ? diffDays + 1 : null;
+  return diffDays >= 0 ? diffDays - 1 : null;
 }
 
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10 day(s) in the selected period.
Received:
  8 day(s) in the selected period.

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:47:13
 }
 
 const columns = [
-  { Header: "Perm", accessor: "perm" },
+  { Header: "", accessor: "perm" },
   { Header: "Last Name", accessor: "lastName" },
   { Header: "First/Middle Name", accessor: "firstMiddleName" },
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Perm
Received:

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:48:36
 
 const columns = [
   { Header: "Perm", accessor: "perm" },
-  { Header: "Last Name", accessor: "lastName" },
+  { Header: "Last Name", accessor: "" },
   { Header: "First/Middle Name", accessor: "firstMiddleName" },
   {
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-header-lastName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:49:3
 const columns = [
   { Header: "Perm", accessor: "perm" },
   { Header: "Last Name", accessor: "lastName" },
-  { Header: "First/Middle Name", accessor: "firstMiddleName" },
+  {},
   {
     Header: "Interacted",
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:51:13
   { Header: "Last Name", accessor: "lastName" },
   { Header: "First/Middle Name", accessor: "firstMiddleName" },
   {
-    Header: "Interacted",
+    Header: "",
     accessor: "interactedAtLeastOnce",
     Cell: ({ value }) => (value ? "Yes" : "No"),
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Interacted
Received:

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:55:13
     accessor: "interactedAtLeastOnce",
     Cell: ({ value }) => (value ? "Yes" : "No"),
   },
-  { Header: "Days Interacted", accessor: "daysInteracted" },
+  { Header: "", accessor: "daysInteracted" },
   {
     Header: "Owned & Checked In On a Cow",
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Days Interacted
Received:

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:61:40
     accessor: "ownedAndCheckedInOnACow",
     Cell: ({ value }) => (value ? "Yes" : "No"),
   },
-  { Header: "Points Earned", accessor: "totalPointsEarned" },
+  { Header: "Points Earned", accessor: "" },
 ];
 
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-header-totalPointsEarned"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:76:15
     watch,
     getValues,
     formState: { errors },
-  } = useForm({ defaultValues: DEFAULT_VALUES });
+  } = useForm({});
 
   const [grades, setGrades] = useState(null);
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveValue(40)

Expected the element to have value:
  40
Received:
  null

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:91:12
   const criterion2Weight = watch("criterion2Weight");
   const criterion3Weight = watch("criterion3Weight");
   const totalWeight =
-    Number(criterion1Weight || 0) +
+    Number(false) +
     Number(criterion2Weight || 0) +
     Number(criterion3Weight || 0);
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  60%

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:92:12
   const criterion3Weight = watch("criterion3Weight");
   const totalWeight =
     Number(criterion1Weight || 0) +
-    Number(criterion2Weight || 0) +
+    Number(true) +
     Number(criterion3Weight || 0);
 
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  61%

[Killed] LogicalOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:93:12
   const totalWeight =
     Number(criterion1Weight || 0) +
     Number(criterion2Weight || 0) +
-    Number(criterion3Weight || 0);
+    Number(criterion3Weight && 0);
 
   // No explicit method: axios defaults to GET, and this keeps the source
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100%
Received:
  80%

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:99:49
   // free of a "GET" string literal whose value axios ignores anyway (it
   // falls back to GET for any falsy method), which would otherwise be an
   // unkillable mutation-testing survivor.
-  const objectToAxiosParamsCompute = (data) => ({
-    url: "/api/participationgrade/compute",
-    params: { courseId, ...data },
-  });
+  const objectToAxiosParamsCompute = (data) => ({});
 
   const computeMutation = useBackendMutation(objectToAxiosParamsCompute, {
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: Cannot read properties of undefined (reading 'totalPoints')

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:104:74
     params: { courseId, ...data },
   });
 
-  const computeMutation = useBackendMutation(objectToAxiosParamsCompute, {
-    onSuccess: (data) => {
-      setGrades(data);
-      toast(`Computed grades for ${data.length} student(s).`);
-    },
-  });
+  const computeMutation = useBackendMutation(objectToAxiosParamsCompute, {});
 
   const onSubmit = (data) => {
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:134:30
               <Form.Control
                 id="startDate"
                 type="date"
-                data-testid={`${testid}-startDate`}
+                data-testid={``}
                 isInvalid={!!errors.startDate}
                 {...register("startDate", {
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-startDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:153:41
                 type="date"
                 data-testid={`${testid}-endDate`}
                 isInvalid={!!errors.endDate}
-                {...register("endDate", {
-                  required: "End date is required",
-                  validate: {
-                    isAfterStartDate: (v) =>
-                      v >= getValues("startDate") ||
-                      "End date must not be before start date",
-                  },
-                })}
+                {...register("endDate", {})}
               />
               <Form.Control.Feedback type="invalid">
killedBy: ParticipationGradeTabComponent tests shows an error when end date is left empty
statusReason: Unable to find an element with the text: End date is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:154:29
                 data-testid={`${testid}-endDate`}
                 isInvalid={!!errors.endDate}
                 {...register("endDate", {
-                  required: "End date is required",
+                  required: "",
                   validate: {
                     isAfterStartDate: (v) =>
killedBy: ParticipationGradeTabComponent tests shows an error when end date is left empty
statusReason: Unable to find an element with the text: End date is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:176:30
                 id="totalPoints"
                 type="number"
                 step="0.01"
-                data-testid={`${testid}-totalPoints`}
+                data-testid={``}
                 isInvalid={!!errors.totalPoints}
                 {...register("totalPoints", {
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-totalPoints"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:212:32
                   id="criterion1Weight"
                   type="number"
                   aria-label="Interacted at least once (% weight)"
-                  data-testid={`${testid}-criterion1Weight`}
+                  data-testid={``}
                   isInvalid={!!errors.criterion1Weight}
                   {...register("criterion1Weight", {
killedBy: ParticipationGradeTabComponent tests renders the form with the expected default weights
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-criterion1Weight"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:218:26
                     valueAsNumber: true,
                     required: true,
                     min: { value: 0, message: "Weight must be 0-100" },
-                    max: { value: 100, message: "Weight must be 0-100" },
+                    max: {},
                   })}
                 />
killedBy: ParticipationGradeTabComponent tests shows 'Weight must be 0-100' when criterion1Weight is set to 150
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:239:47
                   {...register("criterion3Weight", {
                     valueAsNumber: true,
                     required: true,
-                    min: { value: 0, message: "Weight must be 0-100" },
+                    min: { value: 0, message: "" },
                     max: { value: 100, message: "Weight must be 0-100" },
                     validate: {
killedBy: ParticipationGradeTabComponent tests shows 'Weight must be 0-100' when criterion3Weight is set to -10
statusReason: Unable to find an element with the text: Weight must be 0-100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:244:34
                     validate: {
                       sumsTo100: (v) => {
                         const sum =
-                          Number(getValues("criterion1Weight") || 0) +
+                          Number(true) +
                           Number(getValues("criterion2Weight") || 0) +
                           Number(v || 0);
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:248:27
                           Number(getValues("criterion2Weight") || 0) +
                           Number(v || 0);
                         return (
-                          sum === 100 ||
+                          sum !== 100 ||
                           "The three weights must sum to 100 (currently " +
                             sum +
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:249:27
                           Number(v || 0);
                         return (
                           sum === 100 ||
-                          "The three weights must sum to 100 (currently " +
+                          "" +
                             sum +
                             ")"
killedBy: ParticipationGradeTabComponent tests rejects submission when weights do not sum to 100
statusReason: Unable to find an element with the text: The three weights must sum to 100 (currently 110). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:251:29
                           sum === 100 ||
                           "The three weights must sum to 100 (currently " +
                             sum +
-                            ")"
+                            ""
                         );
                       },
killedBy: ParticipationGradeTabComponent tests rejects submission when weights do not sum to 100
statusReason: Unable to find an element with the text: The three weights must sum to 100 (currently 110). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ObjectLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:298:33
                     {...register("criterion2MinDays", {
                       valueAsNumber: true,
                       required: true,
-                      validate: {
-                        inRange: (v) => {
-                          if (Number(getValues("criterion2Weight")) === 0) {
-                            return true;
-                          }
-                          const max = daysInPeriod(
-                            getValues("startDate"),
-                            getValues("endDate"),
-                          );
-                          if (max === null) {
-                            return true;
-                          }
-                          return (
-                            (v >= 1 && v <= max) ||
-                            `n must be between 1 and ${max} (the number of days in the period)`
-                          );
-                        },
-                      },
+                      validate: {},
                     })}
                   />
killedBy: ParticipationGradeTabComponent tests rejects a criterion2MinDays outside the period, when criterion 2 is enabled
statusReason: Unable to find an element with the text: n must be between 1 and 5 (the number of days in the period). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] EqualityOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:307:31
                             getValues("startDate"),
                             getValues("endDate"),
                           );
-                          if (max === null) {
+                          if (max !== null) {
                             return true;
                           }
killedBy: ParticipationGradeTabComponent tests rejects a criterion2MinDays outside the period, when criterion 2 is enabled
statusReason: Unable to find an element with the text: n must be between 1 and 5 (the number of days in the period). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:311:30
                             return true;
                           }
                           return (
-                            (v >= 1 && v <= max) ||
+                            (false) ||
                             `n must be between 1 and ${max} (the number of days in the period)`
                           );
killedBy: ParticipationGradeTabComponent tests submitting a changed totalPoints sends it as a number, not a string
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:357:10
           </tbody>
         </Table>
 
-        {period !== null && (
-          <p data-testid={`${testid}-daysInPeriod`}>
-            {period} day(s) in the selected period.
-          </p>
-        )}
+        {true}
 
         <Button
killedBy: ParticipationGradeTabComponent tests shows the number of days in the selected period, inclusive of both ends
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-daysInPeriod"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:357:10
           </tbody>
         </Table>
 
-        {period !== null && (
+        {true && (
           <p data-testid={`${testid}-daysInPeriod`}>
             {period} day(s) in the selected period.
killedBy: ParticipationGradeTabComponent tests does not show the days-in-period hint or the download button before a date range is chosen
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  data-testid="ParticipationGradeTabComponent-daysInPeriod"
>
   day(s) in the selected period.
</p> instead

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:367:24
           type="submit"
           variant="primary"
           className="mb-3 me-2"
-          data-testid={`${testid}-preview-button`}
+          data-testid={``}
           disabled={computeMutation.isLoading}
         >
killedBy: ParticipationGradeTabComponent tests shows an error when start date is left empty
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-preview-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] LogicalOperator
main/components/Courses/ParticipationGradeTabComponent.jsx:372:10
         >
           Preview Grades
         </Button>
-        {downloadUrl && (
-          <Button
-            href={downloadUrl}
-            variant="success"
-            className="mb-3"
-            data-testid={`${testid}-download-button`}
-          >
-            Download CSV
-          </Button>
-        )}
+        {downloadUrl || <Button href={downloadUrl} variant="success" className="mb-3" data-testid={`${testid}-download-button`}>
+            Download CSV
+          </Button>}
       </Form>
 
killedBy: ParticipationGradeTabComponent tests does not show the days-in-period hint or the download button before a date range is chosen
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="mb-3 btn btn-success"
  data-testid="ParticipationGradeTabComponent-download-button"
  type="button"
>
  Download CSV

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:377:26
             href={downloadUrl}
             variant="success"
             className="mb-3"
-            data-testid={`${testid}-download-button`}
+            data-testid={``}
           >
             Download CSV
killedBy: ParticipationGradeTabComponent tests shows a Download CSV button with a matching query string only after a successful preview
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-download-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:384:8
         )}
       </Form>
 
-      {grades && (
-        <>
-          <PageSizeSelector
-            value={pageSize}
-            onChange={handlePageSizeChange}
-            options={PAGE_SIZE_OPTIONS}
-            testid={`${testid}-table-page-size-selector`}
-          />
-          <OurTable
-            data={grades}
-            columns={columns}
-            testid={`${testid}-table`}
-            pageSize={pageSize}
-          />
-        </>
-      )}
+      {false}
     </div>
   );
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] ConditionalExpression
main/components/Courses/ParticipationGradeTabComponent.jsx:384:8
         )}
       </Form>
 
-      {grades && (
-        <>
-          <PageSizeSelector
-            value={pageSize}
-            onChange={handlePageSizeChange}
-            options={PAGE_SIZE_OPTIONS}
-            testid={`${testid}-table-page-size-selector`}
-          />
-          <OurTable
-            data={grades}
-            columns={columns}
-            testid={`${testid}-table`}
-            pageSize={pageSize}
-          />
-        </>
-      )}
+      {true}
     </div>
   );
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:390:21
             value={pageSize}
             onChange={handlePageSizeChange}
             options={PAGE_SIZE_OPTIONS}
-            testid={`${testid}-table-page-size-selector`}
+            testid={``}
           />
           <OurTable
killedBy: ParticipationGradeTabComponent tests renders a Page Size selector defaulting to 20 after a preview
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-page-size-selector"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >

[Killed] StringLiteral
main/components/Courses/ParticipationGradeTabComponent.jsx:395:21
           <OurTable
             data={grades}
             columns={columns}
-            testid={`${testid}-table`}
+            testid={``}
             pageSize={pageSize}
           />
killedBy: ParticipationGradeTabComponent tests submits the form, renders the results table, and shows a summary toast
statusReason: Unable to find an element by: [data-testid="ParticipationGradeTabComponent-table-cell-row-0-col-perm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ParticipationGradeTabComponent"
    >
